Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x85a (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x9bca4): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x91319): ../ApplicationLayer/BTC/BTC.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x6584d): C:/Users/Daniel/Documents/BMWI4/I4_BCC_WORKSPACE/I4_BCC/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x4f4c0): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x2df4a): __uint8_t
    <35>   DW_AT_decl_file   : 2
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)

    <147>   DW_AT_decl_file   : 8
    <148>   DW_AT_decl_line   : 44
    <149>   DW_AT_decl_column : 14
    <14a>   DW_AT_type        : <0xd6>
    <14e>   DW_AT_external    : 1
    <14e>   DW_AT_declaration : 1
 <1><14e>: Abbrev Number: 8 (DW_TAG_variable)
    <14f>   DW_AT_name        : (indirect string, offset: 0x4eab8): Btc_TurnSignalLeft
    <153>   DW_AT_decl_file   : 8
    <154>   DW_AT_decl_line   : 45
    <155>   DW_AT_decl_column : 14
    <156>   DW_AT_type        : <0xd6>
    <15a>   DW_AT_external    : 1
    <15a>   DW_AT_declaration : 1
 <1><15a>: Abbrev Number: 8 (DW_TAG_variable)
    <15b>   DW_AT_name        : (indirect string, offset: 0x44170): Btc_TurnSignalRight
    <15f>   DW_AT_decl_file   : 8
    <160>   DW_AT_decl_line   : 46
    <161>   DW_AT_decl_column : 14
    <162>   DW_AT_type        : <0xd6>
    <166>   DW_AT_external    : 1
    <166>   DW_AT_declaration : 1
 <1><166>: Abbrev Number: 8 (DW_TAG_variable)
    <167>   DW_AT_name        : (indirect string, offset: 0x4220b): Btc_HazardLight
    <16b>   DW_AT_decl_file   : 8
    <16c>   DW_AT_decl_line   : 47
    <16d>   DW_AT_decl_column : 14
    <16e>   DW_AT_type        : <0xd6>
    <172>   DW_AT_external    : 1
    <172>   DW_AT_declaration : 1
 <1><172>: Abbrev Number: 8 (DW_TAG_variable)
    <173>   DW_AT_name        : (indirect string, offset: 0x78b73): Btc_RearFogLight
    <177>   DW_AT_decl_file   : 8
    <178>   DW_AT_decl_line   : 49
    <179>   DW_AT_decl_column : 14
    <17a>   DW_AT_type        : <0xd6>
    <17e>   DW_AT_external    : 1
    <17e>   DW_AT_declaration : 1
 <1><17e>: Abbrev Number: 2 (DW_TAG_base_type)
    <17f>   DW_AT_byte_size   : 4
    <180>   DW_AT_encoding    : 4	(float)
    <181>   DW_AT_name        : (indirect string, offset: 0x2ed25): float
 <1><185>: Abbrev Number: 8 (DW_TAG_variable)
    <186>   DW_AT_name        : (indirect string, offset: 0x94bab): Btc_TemperatureValue
    <18a>   DW_AT_decl_file   : 9
    <18b>   DW_AT_decl_line   : 25
    <18c>   DW_AT_decl_column : 14
    <18d>   DW_AT_type        : <0xd6>
    <191>   DW_AT_external    : 1
    <191>   DW_AT_declaration : 1
 <1><191>: Abbrev Number: 8 (DW_TAG_variable)
    <192>   DW_AT_name        : (indirect string, offset: 0x5f2b3): Btc_FanValue
    <196>   DW_AT_decl_file   : 9
    <197>   DW_AT_decl_line   : 26
    <198>   DW_AT_decl_column : 14
    <199>   DW_AT_type        : <0xd6>
    <19d>   DW_AT_external    : 1
    <19d>   DW_AT_declaration : 1
 <1><19d>: Abbrev Number: 8 (DW_TAG_variable)
    <19e>   DW_AT_name        : (indirect string, offset: 0xd9ab): Btc_LegVents
    <1a2>   DW_AT_decl_file   : 9
    <1a3>   DW_AT_decl_line   : 27
    <1a4>   DW_AT_decl_column : 14
    <1a5>   DW_AT_type        : <0xd6>
    <1a9>   DW_AT_external    : 1
    <1a9>   DW_AT_declaration : 1
 <1><1a9>: Abbrev Number: 8 (DW_TAG_variable)
    <1aa>   DW_AT_name        : (indirect string, offset: 0x4566f): Btc_MidVents
    <1ae>   DW_AT_decl_file   : 9
    <1af>   DW_AT_decl_line   : 28
    <1b0>   DW_AT_decl_column : 14
    <1b1>   DW_AT_type        : <0xd6>
    <1b5>   DW_AT_external    : 1
    <1b5>   DW_AT_declaration : 1
 <1><1b5>: Abbrev Number: 8 (DW_TAG_variable)
    <1b6>   DW_AT_name        : (indirect string, offset: 0x413d8): Btc_WindshieldVents
    <1ba>   DW_AT_decl_file   : 9
    <1bb>   DW_AT_decl_line   : 29
    <1bc>   DW_AT_decl_column : 14
    <1bd>   DW_AT_type        : <0xd6>
    <1c1>   DW_AT_external    : 1
    <1c1>   DW_AT_declaration : 1
 <1><1c1>: Abbrev Number: 8 (DW_TAG_variable)
    <1c2>   DW_AT_name        : (indirect string, offset: 0x30bd8): Btc_WindshieldDefrost
    <1c6>   DW_AT_decl_file   : 9
    <1c7>   DW_AT_decl_line   : 30
    <1c8>   DW_AT_decl_column : 14
    <1c9>   DW_AT_type        : <0xd6>
    <1cd>   DW_AT_external    : 1
    <1cd>   DW_AT_declaration : 1
 <1><1cd>: Abbrev Number: 8 (DW_TAG_variable)
    <1ce>   DW_AT_name        : (indirect string, offset: 0xd7a8): Btc_BackwindowDefrost
    <1d2>   DW_AT_decl_file   : 9
    <1d3>   DW_AT_decl_line   : 31
    <1d4>   DW_AT_decl_column : 14
    <1d5>   DW_AT_type        : <0xd6>
    <1d9>   DW_AT_external    : 1
    <1d9>   DW_AT_declaration : 1
 <1><1d9>: Abbrev Number: 8 (DW_TAG_variable)
    <1da>   DW_AT_name        : (indirect string, offset: 0x1f5c6): Btc_AC
    <1de>   DW_AT_decl_file   : 9
    <1df>   DW_AT_decl_line   : 32
    <1e0>   DW_AT_decl_column : 14
    <1e1>   DW_AT_type        : <0xd6>
    <1e5>   DW_AT_external    : 1
    <1e5>   DW_AT_declaration : 1
 <1><1e5>: Abbrev Number: 8 (DW_TAG_variable)
    <1e6>   DW_AT_name        : (indirect string, offset: 0x8f698): Btc_AutomaticMode
    <1ea>   DW_AT_decl_file   : 9
    <1eb>   DW_AT_decl_line   : 33
    <1ec>   DW_AT_decl_column : 14
    <1ed>   DW_AT_type        : <0xd6>
    <1f1>   DW_AT_external    : 1
    <1f1>   DW_AT_declaration : 1
 <1><1f1>: Abbrev Number: 8 (DW_TAG_variable)
    <1f2>   DW_AT_name        : (indirect string, offset: 0x96bad): Btc_RecirculationMode
    <1f6>   DW_AT_decl_file   : 9
    <1f7>   DW_AT_decl_line   : 34
    <1f8>   DW_AT_decl_column : 14
    <1f9>   DW_AT_type        : <0xd6>
    <1fd>   DW_AT_external    : 1
    <1fd>   DW_AT_declaration : 1
 <1><1fd>: Abbrev Number: 8 (DW_TAG_variable)
    <1fe>   DW_AT_name        : (indirect string, offset: 0x30bc9): Btc_NormalMode
    <202>   DW_AT_decl_file   : 9
    <203>   DW_AT_decl_line   : 35
    <204>   DW_AT_decl_column : 14
    <205>   DW_AT_type        : <0xd6>
    <209>   DW_AT_external    : 1
    <209>   DW_AT_declaration : 1
 <1><209>: Abbrev Number: 9 (DW_TAG_structure_type)
    <20a>   DW_AT_byte_size   : 24
    <20b>   DW_AT_decl_file   : 10
    <20c>   DW_AT_decl_line   : 214
    <20d>   DW_AT_decl_column : 9
    <20e>   DW_AT_sibling     : <0x260>
 <2><212>: Abbrev Number: 10 (DW_TAG_member)
    <213>   DW_AT_name        : CR
    <216>   DW_AT_decl_file   : 10
    <217>   DW_AT_decl_line   : 216
    <218>   DW_AT_decl_column : 17
    <219>   DW_AT_type        : <0xc1>
    <21d>   DW_AT_data_member_location: 0
 <2><21e>: Abbrev Number: 11 (DW_TAG_member)
    <21f>   DW_AT_name        : (indirect string, offset: 0x4d857): NDTR
    <223>   DW_AT_decl_file   : 10
    <224>   DW_AT_decl_line   : 217
    <225>   DW_AT_decl_column : 17
    <226>   DW_AT_type        : <0xc1>
    <22a>   DW_AT_data_member_location: 4
 <2><22b>: Abbrev Number: 10 (DW_TAG_member)
    <22c>   DW_AT_name        : PAR
    <230>   DW_AT_decl_file   : 10
    <231>   DW_AT_decl_line   : 218
    <232>   DW_AT_decl_column : 17
    <233>   DW_AT_type        : <0xc1>
    <237>   DW_AT_data_member_location: 8
 <2><238>: Abbrev Number: 11 (DW_TAG_member)
    <239>   DW_AT_name        : (indirect string, offset: 0x417e7): M0AR
    <23d>   DW_AT_decl_file   : 10
    <23e>   DW_AT_decl_line   : 219
    <23f>   DW_AT_decl_column : 17
    <240>   DW_AT_type        : <0xc1>
    <244>   DW_AT_data_member_location: 12
 <2><245>: Abbrev Number: 11 (DW_TAG_member)
    <246>   DW_AT_name        : (indirect string, offset: 0xee9c): M1AR
    <24a>   DW_AT_decl_file   : 10
    <24b>   DW_AT_decl_line   : 220
    <24c>   DW_AT_decl_column : 17
    <24d>   DW_AT_type        : <0xc1>
    <251>   DW_AT_data_member_location: 16
 <2><252>: Abbrev Number: 10 (DW_TAG_member)
    <253>   DW_AT_name        : FCR
    <257>   DW_AT_decl_file   : 10
    <258>   DW_AT_decl_line   : 221
    <259>   DW_AT_decl_column : 17
    <25a>   DW_AT_type        : <0xc1>
    <25e>   DW_AT_data_member_location: 20
 <2><25f>: Abbrev Number: 0
 <1><260>: Abbrev Number: 3 (DW_TAG_typedef)
    <261>   DW_AT_name        : (indirect string, offset: 0x8f7bb): DMA_Stream_TypeDef
    <265>   DW_AT_decl_file   : 10
    <266>   DW_AT_decl_line   : 222
    <267>   DW_AT_decl_column : 3
    <268>   DW_AT_type        : <0x209>
 <1><26c>: Abbrev Number: 12 (DW_TAG_structure_type)
    <26d>   DW_AT_byte_size   : 28
    <26e>   DW_AT_decl_file   : 10
    <26f>   DW_AT_decl_line   : 499
    <271>   DW_AT_decl_column : 9
    <272>   DW_AT_sibling     : <0x2d7>
 <2><276>: Abbrev Number: 13 (DW_TAG_member)
    <277>   DW_AT_name        : SR
    <27a>   DW_AT_decl_file   : 10
    <27b>   DW_AT_decl_line   : 501
    <27d>   DW_AT_decl_column : 17
    <27e>   DW_AT_type        : <0xc1>
    <282>   DW_AT_data_member_location: 0
 <2><283>: Abbrev Number: 13 (DW_TAG_member)
    <284>   DW_AT_name        : DR
    <287>   DW_AT_decl_file   : 10
    <288>   DW_AT_decl_line   : 502
    <28a>   DW_AT_decl_column : 17
    <28b>   DW_AT_type        : <0xc1>
    <28f>   DW_AT_data_member_location: 4
 <2><290>: Abbrev Number: 13 (DW_TAG_member)
    <291>   DW_AT_name        : BRR
    <295>   DW_AT_decl_file   : 10
    <296>   DW_AT_decl_line   : 503
    <298>   DW_AT_decl_column : 17
    <299>   DW_AT_type        : <0xc1>
    <29d>   DW_AT_data_member_location: 8
 <2><29e>: Abbrev Number: 13 (DW_TAG_member)
    <29f>   DW_AT_name        : CR1
    <2a3>   DW_AT_decl_file   : 10
    <2a4>   DW_AT_decl_line   : 504
    <2a6>   DW_AT_decl_column : 17
    <2a7>   DW_AT_type        : <0xc1>
    <2ab>   DW_AT_data_member_location: 12
 <2><2ac>: Abbrev Number: 13 (DW_TAG_member)
    <2ad>   DW_AT_name        : CR2
    <2b1>   DW_AT_decl_file   : 10
    <2b2>   DW_AT_decl_line   : 505
    <2b4>   DW_AT_decl_column : 17
    <2b5>   DW_AT_type        : <0xc1>
    <2b9>   DW_AT_data_member_location: 16
 <2><2ba>: Abbrev Number: 13 (DW_TAG_member)
    <2bb>   DW_AT_name        : CR3
    <2bf>   DW_AT_decl_file   : 10
    <2c0>   DW_AT_decl_line   : 506
    <2c2>   DW_AT_decl_column : 17
    <2c3>   DW_AT_type        : <0xc1>
    <2c7>   DW_AT_data_member_location: 20
 <2><2c8>: Abbrev Number: 14 (DW_TAG_member)
    <2c9>   DW_AT_name        : (indirect string, offset: 0x2c08c): GTPR
    <2cd>   DW_AT_decl_file   : 10
    <2ce>   DW_AT_decl_line   : 507
    <2d0>   DW_AT_decl_column : 17
    <2d1>   DW_AT_type        : <0xc1>
    <2d5>   DW_AT_data_member_location: 24
 <2><2d6>: Abbrev Number: 0
 <1><2d7>: Abbrev Number: 15 (DW_TAG_typedef)
    <2d8>   DW_AT_name        : (indirect string, offset: 0x9c9d3): USART_TypeDef
    <2dc>   DW_AT_decl_file   : 10
    <2dd>   DW_AT_decl_line   : 508
    <2df>   DW_AT_decl_column : 3
    <2e0>   DW_AT_type        : <0x26c>
 <1><2e4>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <2e5>   DW_AT_encoding    : 7	(unsigned)
    <2e6>   DW_AT_byte_size   : 1
    <2e7>   DW_AT_type        : <0x3c>
    <2eb>   DW_AT_decl_file   : 11
    <2ec>   DW_AT_decl_line   : 39
    <2ed>   DW_AT_decl_column : 1
    <2ee>   DW_AT_sibling     : <0x30b>
 <2><2f2>: Abbrev Number: 17 (DW_TAG_enumerator)
    <2f3>   DW_AT_name        : (indirect string, offset: 0x3551a): HAL_OK
    <2f7>   DW_AT_const_value : 0
 <2><2f8>: Abbrev Number: 17 (DW_TAG_enumerator)
    <2f9>   DW_AT_name        : (indirect string, offset: 0x62995): HAL_ERROR
    <2fd>   DW_AT_const_value : 1
 <2><2fe>: Abbrev Number: 17 (DW_TAG_enumerator)
    <2ff>   DW_AT_name        : (indirect string, offset: 0x840a7): HAL_BUSY
    <303>   DW_AT_const_value : 2
 <2><304>: Abbrev Number: 17 (DW_TAG_enumerator)
    <305>   DW_AT_name        : (indirect string, offset: 0x2e53e): HAL_TIMEOUT
    <309>   DW_AT_const_value : 3
 <2><30a>: Abbrev Number: 0
 <1><30b>: Abbrev Number: 3 (DW_TAG_typedef)
    <30c>   DW_AT_name        : (indirect string, offset: 0x8d977): HAL_StatusTypeDef
    <310>   DW_AT_decl_file   : 11
    <311>   DW_AT_decl_line   : 44
    <312>   DW_AT_decl_column : 3
    <313>   DW_AT_type        : <0x2e4>
 <1><317>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <318>   DW_AT_encoding    : 7	(unsigned)
    <319>   DW_AT_byte_size   : 1
    <31a>   DW_AT_type        : <0x3c>
    <31e>   DW_AT_decl_file   : 11
    <31f>   DW_AT_decl_line   : 50
    <320>   DW_AT_decl_column : 1
    <321>   DW_AT_sibling     : <0x332>
 <2><325>: Abbrev Number: 17 (DW_TAG_enumerator)
    <326>   DW_AT_name        : (indirect string, offset: 0x75181): HAL_UNLOCKED
    <32a>   DW_AT_const_value : 0
 <2><32b>: Abbrev Number: 17 (DW_TAG_enumerator)
    <32c>   DW_AT_name        : (indirect string, offset: 0x9dcf4): HAL_LOCKED
    <330>   DW_AT_const_value : 1
 <2><331>: Abbrev Number: 0
 <1><332>: Abbrev Number: 3 (DW_TAG_typedef)
    <333>   DW_AT_name        : (indirect string, offset: 0x602b8): HAL_LockTypeDef
    <337>   DW_AT_decl_file   : 11
    <338>   DW_AT_decl_line   : 53
    <339>   DW_AT_decl_column : 3
    <33a>   DW_AT_type        : <0x317>
 <1><33e>: Abbrev Number: 9 (DW_TAG_structure_type)
    <33f>   DW_AT_byte_size   : 48
    <340>   DW_AT_decl_file   : 12
    <341>   DW_AT_decl_line   : 48
    <342>   DW_AT_decl_column : 9
    <343>   DW_AT_sibling     : <0x3e4>
 <2><347>: Abbrev Number: 11 (DW_TAG_member)
    <348>   DW_AT_name        : (indirect string, offset: 0xa1635): Channel
    <34c>   DW_AT_decl_file   : 12
    <34d>   DW_AT_decl_line   : 50
    <34e>   DW_AT_decl_column : 12
    <34f>   DW_AT_type        : <0xb5>
    <353>   DW_AT_data_member_location: 0
 <2><354>: Abbrev Number: 11 (DW_TAG_member)
    <355>   DW_AT_name        : (indirect string, offset: 0xa2fee): Direction
    <359>   DW_AT_decl_file   : 12
    <35a>   DW_AT_decl_line   : 53
    <35b>   DW_AT_decl_column : 12
    <35c>   DW_AT_type        : <0xb5>
    <360>   DW_AT_data_member_location: 4
 <2><361>: Abbrev Number: 11 (DW_TAG_member)
    <362>   DW_AT_name        : (indirect string, offset: 0xa55d): PeriphInc
    <366>   DW_AT_decl_file   : 12
    <367>   DW_AT_decl_line   : 57
    <368>   DW_AT_decl_column : 12
    <369>   DW_AT_type        : <0xb5>
    <36d>   DW_AT_data_member_location: 8
 <2><36e>: Abbrev Number: 11 (DW_TAG_member)
    <36f>   DW_AT_name        : (indirect string, offset: 0x19868): MemInc
    <373>   DW_AT_decl_file   : 12
    <374>   DW_AT_decl_line   : 60
    <375>   DW_AT_decl_column : 12
    <376>   DW_AT_type        : <0xb5>
    <37a>   DW_AT_data_member_location: 12
 <2><37b>: Abbrev Number: 11 (DW_TAG_member)
    <37c>   DW_AT_name        : (indirect string, offset: 0x4ebb8): PeriphDataAlignment
    <380>   DW_AT_decl_file   : 12
    <381>   DW_AT_decl_line   : 63
    <382>   DW_AT_decl_column : 12
    <383>   DW_AT_type        : <0xb5>
    <387>   DW_AT_data_member_location: 16
 <2><388>: Abbrev Number: 11 (DW_TAG_member)
    <389>   DW_AT_name        : (indirect string, offset: 0x8e9e5): MemDataAlignment
    <38d>   DW_AT_decl_file   : 12
    <38e>   DW_AT_decl_line   : 66
    <38f>   DW_AT_decl_column : 12
    <390>   DW_AT_type        : <0xb5>
    <394>   DW_AT_data_member_location: 20
 <2><395>: Abbrev Number: 11 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0xa51c5): Mode
    <39a>   DW_AT_decl_file   : 12
    <39b>   DW_AT_decl_line   : 69
    <39c>   DW_AT_decl_column : 12
    <39d>   DW_AT_type        : <0xb5>
    <3a1>   DW_AT_data_member_location: 24
 <2><3a2>: Abbrev Number: 11 (DW_TAG_member)
    <3a3>   DW_AT_name        : (indirect string, offset: 0xa1ab3): Priority
    <3a7>   DW_AT_decl_file   : 12
    <3a8>   DW_AT_decl_line   : 74
    <3a9>   DW_AT_decl_column : 12
    <3aa>   DW_AT_type        : <0xb5>
    <3ae>   DW_AT_data_member_location: 28
 <2><3af>: Abbrev Number: 11 (DW_TAG_member)
    <3b0>   DW_AT_name        : (indirect string, offset: 0x4400f): FIFOMode
    <3b4>   DW_AT_decl_file   : 12
    <3b5>   DW_AT_decl_line   : 77
    <3b6>   DW_AT_decl_column : 12
    <3b7>   DW_AT_type        : <0xb5>
    <3bb>   DW_AT_data_member_location: 32
 <2><3bc>: Abbrev Number: 11 (DW_TAG_member)
    <3bd>   DW_AT_name        : (indirect string, offset: 0x78603): FIFOThreshold
    <3c1>   DW_AT_decl_file   : 12
    <3c2>   DW_AT_decl_line   : 82
    <3c3>   DW_AT_decl_column : 12
    <3c4>   DW_AT_type        : <0xb5>
    <3c8>   DW_AT_data_member_location: 36
 <2><3c9>: Abbrev Number: 11 (DW_TAG_member)
    <3ca>   DW_AT_name        : (indirect string, offset: 0x76c2d): MemBurst
    <3ce>   DW_AT_decl_file   : 12
    <3cf>   DW_AT_decl_line   : 85
    <3d0>   DW_AT_decl_column : 12
    <3d1>   DW_AT_type        : <0xb5>
    <3d5>   DW_AT_data_member_location: 40
 <2><3d6>: Abbrev Number: 11 (DW_TAG_member)
    <3d7>   DW_AT_name        : (indirect string, offset: 0x36287): PeriphBurst
    <3db>   DW_AT_decl_file   : 12
    <3dc>   DW_AT_decl_line   : 91
    <3dd>   DW_AT_decl_column : 12
    <3de>   DW_AT_type        : <0xb5>
    <3e2>   DW_AT_data_member_location: 44
 <2><3e3>: Abbrev Number: 0
 <1><3e4>: Abbrev Number: 3 (DW_TAG_typedef)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x2aaa1): DMA_InitTypeDef
    <3e9>   DW_AT_decl_file   : 12
    <3ea>   DW_AT_decl_line   : 96
    <3eb>   DW_AT_decl_column : 2
    <3ec>   DW_AT_type        : <0x33e>
 <1><3f0>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <3f1>   DW_AT_encoding    : 7	(unsigned)
    <3f2>   DW_AT_byte_size   : 1
    <3f3>   DW_AT_type        : <0x3c>
    <3f7>   DW_AT_decl_file   : 12
    <3f8>   DW_AT_decl_line   : 103
    <3f9>   DW_AT_decl_column : 1
    <3fa>   DW_AT_sibling     : <0x423>
 <2><3fe>: Abbrev Number: 17 (DW_TAG_enumerator)
    <3ff>   DW_AT_name        : (indirect string, offset: 0x76113): HAL_DMA_STATE_RESET
    <403>   DW_AT_const_value : 0
 <2><404>: Abbrev Number: 17 (DW_TAG_enumerator)
    <405>   DW_AT_name        : (indirect string, offset: 0x2b953): HAL_DMA_STATE_READY
    <409>   DW_AT_const_value : 1
 <2><40a>: Abbrev Number: 17 (DW_TAG_enumerator)
    <40b>   DW_AT_name        : (indirect string, offset: 0x6d27b): HAL_DMA_STATE_BUSY
    <40f>   DW_AT_const_value : 2
 <2><410>: Abbrev Number: 17 (DW_TAG_enumerator)
    <411>   DW_AT_name        : (indirect string, offset: 0x9b66a): HAL_DMA_STATE_TIMEOUT
    <415>   DW_AT_const_value : 3
 <2><416>: Abbrev Number: 17 (DW_TAG_enumerator)
    <417>   DW_AT_name        : (indirect string, offset: 0x87271): HAL_DMA_STATE_ERROR
    <41b>   DW_AT_const_value : 4
 <2><41c>: Abbrev Number: 17 (DW_TAG_enumerator)
    <41d>   DW_AT_name        : (indirect string, offset: 0x245af): HAL_DMA_STATE_ABORT
    <421>   DW_AT_const_value : 5
 <2><422>: Abbrev Number: 0
 <1><423>: Abbrev Number: 3 (DW_TAG_typedef)
    <424>   DW_AT_name        : (indirect string, offset: 0x577a4): HAL_DMA_StateTypeDef
    <428>   DW_AT_decl_file   : 12
    <429>   DW_AT_decl_line   : 110
    <42a>   DW_AT_decl_column : 2
    <42b>   DW_AT_type        : <0x3f0>
 <1><42f>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <430>   DW_AT_type        : <0x423>
 <1><434>: Abbrev Number: 18 (DW_TAG_structure_type)
    <435>   DW_AT_name        : (indirect string, offset: 0x866c6): __DMA_HandleTypeDef
    <439>   DW_AT_byte_size   : 96
    <43a>   DW_AT_decl_file   : 12
    <43b>   DW_AT_decl_line   : 138
    <43c>   DW_AT_decl_column : 16
    <43d>   DW_AT_sibling     : <0x4f8>
 <2><441>: Abbrev Number: 11 (DW_TAG_member)
    <442>   DW_AT_name        : (indirect string, offset: 0x3d5c2): Instance
    <446>   DW_AT_decl_file   : 12
    <447>   DW_AT_decl_line   : 140
    <448>   DW_AT_decl_column : 31
    <449>   DW_AT_type        : <0x4f8>
    <44d>   DW_AT_data_member_location: 0
 <2><44e>: Abbrev Number: 11 (DW_TAG_member)
    <44f>   DW_AT_name        : (indirect string, offset: 0xa2513): Init
    <453>   DW_AT_decl_file   : 12
    <454>   DW_AT_decl_line   : 142
    <455>   DW_AT_decl_column : 30
    <456>   DW_AT_type        : <0x3e4>
    <45a>   DW_AT_data_member_location: 4
 <2><45b>: Abbrev Number: 11 (DW_TAG_member)
    <45c>   DW_AT_name        : (indirect string, offset: 0xa21c2): Lock
    <460>   DW_AT_decl_file   : 12
    <461>   DW_AT_decl_line   : 144
    <462>   DW_AT_decl_column : 30
    <463>   DW_AT_type        : <0x332>
    <467>   DW_AT_data_member_location: 52
 <2><468>: Abbrev Number: 11 (DW_TAG_member)
    <469>   DW_AT_name        : (indirect string, offset: 0x9fcb3): State
    <46d>   DW_AT_decl_file   : 12
    <46e>   DW_AT_decl_line   : 146
    <46f>   DW_AT_decl_column : 30
    <470>   DW_AT_type        : <0x42f>
    <474>   DW_AT_data_member_location: 53
 <2><475>: Abbrev Number: 11 (DW_TAG_member)
    <476>   DW_AT_name        : (indirect string, offset: 0x9624c): Parent
    <47a>   DW_AT_decl_file   : 12
    <47b>   DW_AT_decl_line   : 148
    <47c>   DW_AT_decl_column : 31
    <47d>   DW_AT_type        : <0xcd>
    <481>   DW_AT_data_member_location: 56
 <2><482>: Abbrev Number: 11 (DW_TAG_member)
    <483>   DW_AT_name        : (indirect string, offset: 0x9d516): XferCpltCallback
    <487>   DW_AT_decl_file   : 12
    <488>   DW_AT_decl_line   : 150
    <489>   DW_AT_decl_column : 33
    <48a>   DW_AT_type        : <0x50f>
    <48e>   DW_AT_data_member_location: 60
 <2><48f>: Abbrev Number: 11 (DW_TAG_member)
    <490>   DW_AT_name        : (indirect string, offset: 0x7adbe): XferHalfCpltCallback
    <494>   DW_AT_decl_file   : 12
    <495>   DW_AT_decl_line   : 152
    <496>   DW_AT_decl_column : 33
    <497>   DW_AT_type        : <0x50f>
    <49b>   DW_AT_data_member_location: 64
 <2><49c>: Abbrev Number: 11 (DW_TAG_member)
    <49d>   DW_AT_name        : (indirect string, offset: 0x261d8): XferM1CpltCallback
    <4a1>   DW_AT_decl_file   : 12
    <4a2>   DW_AT_decl_line   : 154
    <4a3>   DW_AT_decl_column : 33
    <4a4>   DW_AT_type        : <0x50f>
    <4a8>   DW_AT_data_member_location: 68
 <2><4a9>: Abbrev Number: 11 (DW_TAG_member)
    <4aa>   DW_AT_name        : (indirect string, offset: 0x579d8): XferM1HalfCpltCallback
    <4ae>   DW_AT_decl_file   : 12
    <4af>   DW_AT_decl_line   : 156
    <4b0>   DW_AT_decl_column : 33
    <4b1>   DW_AT_type        : <0x50f>
    <4b5>   DW_AT_data_member_location: 72
 <2><4b6>: Abbrev Number: 11 (DW_TAG_member)
    <4b7>   DW_AT_name        : (indirect string, offset: 0x176b7): XferErrorCallback
    <4bb>   DW_AT_decl_file   : 12
    <4bc>   DW_AT_decl_line   : 158
    <4bd>   DW_AT_decl_column : 33
    <4be>   DW_AT_type        : <0x50f>
    <4c2>   DW_AT_data_member_location: 76
 <2><4c3>: Abbrev Number: 11 (DW_TAG_member)
    <4c4>   DW_AT_name        : (indirect string, offset: 0x93740): XferAbortCallback
    <4c8>   DW_AT_decl_file   : 12
    <4c9>   DW_AT_decl_line   : 160
    <4ca>   DW_AT_decl_column : 33
    <4cb>   DW_AT_type        : <0x50f>
    <4cf>   DW_AT_data_member_location: 80
 <2><4d0>: Abbrev Number: 11 (DW_TAG_member)
    <4d1>   DW_AT_name        : (indirect string, offset: 0xa2002): ErrorCode
    <4d5>   DW_AT_decl_file   : 12
    <4d6>   DW_AT_decl_line   : 162
    <4d7>   DW_AT_decl_column : 30
    <4d8>   DW_AT_type        : <0xc1>
    <4dc>   DW_AT_data_member_location: 84
 <2><4dd>: Abbrev Number: 11 (DW_TAG_member)
    <4de>   DW_AT_name        : (indirect string, offset: 0x778a3): StreamBaseAddress
    <4e2>   DW_AT_decl_file   : 12
    <4e3>   DW_AT_decl_line   : 164
    <4e4>   DW_AT_decl_column : 30
    <4e5>   DW_AT_type        : <0xb5>
    <4e9>   DW_AT_data_member_location: 88
 <2><4ea>: Abbrev Number: 11 (DW_TAG_member)
    <4eb>   DW_AT_name        : (indirect string, offset: 0x84e42): StreamIndex
    <4ef>   DW_AT_decl_file   : 12
    <4f0>   DW_AT_decl_line   : 166
    <4f1>   DW_AT_decl_column : 30
    <4f2>   DW_AT_type        : <0xb5>
    <4f6>   DW_AT_data_member_location: 92
 <2><4f7>: Abbrev Number: 0
 <1><4f8>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <4f9>   DW_AT_byte_size   : 4
    <4fa>   DW_AT_type        : <0x260>
 <1><4fe>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <4ff>   DW_AT_prototyped  : 1
    <4ff>   DW_AT_sibling     : <0x509>
 <2><503>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <504>   DW_AT_type        : <0x509>
 <2><508>: Abbrev Number: 0
 <1><509>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <50a>   DW_AT_byte_size   : 4
    <50b>   DW_AT_type        : <0x434>
 <1><50f>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <510>   DW_AT_byte_size   : 4
    <511>   DW_AT_type        : <0x4fe>
 <1><515>: Abbrev Number: 3 (DW_TAG_typedef)
    <516>   DW_AT_name        : (indirect string, offset: 0x866c8): DMA_HandleTypeDef
    <51a>   DW_AT_decl_file   : 12
    <51b>   DW_AT_decl_line   : 168
    <51c>   DW_AT_decl_column : 2
    <51d>   DW_AT_type        : <0x434>
 <1><521>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <522>   DW_AT_byte_size   : 4
    <523>   DW_AT_type        : <0x515>
 <1><527>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <528>   DW_AT_byte_size   : 4
    <529>   DW_AT_type        : <0x93>
 <1><52d>: Abbrev Number: 9 (DW_TAG_structure_type)
    <52e>   DW_AT_byte_size   : 28
    <52f>   DW_AT_decl_file   : 13
    <530>   DW_AT_decl_line   : 46
    <531>   DW_AT_decl_column : 9
    <532>   DW_AT_sibling     : <0x592>
 <2><536>: Abbrev Number: 11 (DW_TAG_member)
    <537>   DW_AT_name        : (indirect string, offset: 0x909a4): BaudRate
    <53b>   DW_AT_decl_file   : 13
    <53c>   DW_AT_decl_line   : 48
    <53d>   DW_AT_decl_column : 12
    <53e>   DW_AT_type        : <0xb5>
    <542>   DW_AT_data_member_location: 0
 <2><543>: Abbrev Number: 11 (DW_TAG_member)
    <544>   DW_AT_name        : (indirect string, offset: 0x4813): WordLength
    <548>   DW_AT_decl_file   : 13
    <549>   DW_AT_decl_line   : 54
    <54a>   DW_AT_decl_column : 12
    <54b>   DW_AT_type        : <0xb5>
    <54f>   DW_AT_data_member_location: 4
 <2><550>: Abbrev Number: 11 (DW_TAG_member)
    <551>   DW_AT_name        : (indirect string, offset: 0x90c2d): StopBits
    <555>   DW_AT_decl_file   : 13
    <556>   DW_AT_decl_line   : 57
    <557>   DW_AT_decl_column : 12
    <558>   DW_AT_type        : <0xb5>
    <55c>   DW_AT_data_member_location: 8
 <2><55d>: Abbrev Number: 11 (DW_TAG_member)
    <55e>   DW_AT_name        : (indirect string, offset: 0x50a02): Parity
    <562>   DW_AT_decl_file   : 13
    <563>   DW_AT_decl_line   : 60
    <564>   DW_AT_decl_column : 12
    <565>   DW_AT_type        : <0xb5>
    <569>   DW_AT_data_member_location: 12
 <2><56a>: Abbrev Number: 11 (DW_TAG_member)
    <56b>   DW_AT_name        : (indirect string, offset: 0xa51c5): Mode
    <56f>   DW_AT_decl_file   : 13
    <570>   DW_AT_decl_line   : 67
    <571>   DW_AT_decl_column : 12
    <572>   DW_AT_type        : <0xb5>
    <576>   DW_AT_data_member_location: 16
 <2><577>: Abbrev Number: 11 (DW_TAG_member)
    <578>   DW_AT_name        : (indirect string, offset: 0x12b7e): HwFlowCtl
    <57c>   DW_AT_decl_file   : 13
    <57d>   DW_AT_decl_line   : 70
    <57e>   DW_AT_decl_column : 12
    <57f>   DW_AT_type        : <0xb5>
    <583>   DW_AT_data_member_location: 20
 <2><584>: Abbrev Number: 11 (DW_TAG_member)
    <585>   DW_AT_name        : (indirect string, offset: 0x84984): OverSampling
    <589>   DW_AT_decl_file   : 13
    <58a>   DW_AT_decl_line   : 73
    <58b>   DW_AT_decl_column : 12
    <58c>   DW_AT_type        : <0xb5>
    <590>   DW_AT_data_member_location: 24
 <2><591>: Abbrev Number: 0
 <1><592>: Abbrev Number: 3 (DW_TAG_typedef)
    <593>   DW_AT_name        : (indirect string, offset: 0x2c89f): UART_InitTypeDef
    <597>   DW_AT_decl_file   : 13
    <598>   DW_AT_decl_line   : 75
    <599>   DW_AT_decl_column : 3
    <59a>   DW_AT_type        : <0x52d>
 <1><59e>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <59f>   DW_AT_encoding    : 7	(unsigned)
    <5a0>   DW_AT_byte_size   : 1
    <5a1>   DW_AT_type        : <0x3c>
    <5a5>   DW_AT_decl_file   : 13
    <5a6>   DW_AT_decl_line   : 117
    <5a7>   DW_AT_decl_column : 1
    <5a8>   DW_AT_sibling     : <0x5dd>
 <2><5ac>: Abbrev Number: 17 (DW_TAG_enumerator)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x5cbfc): HAL_UART_STATE_RESET
    <5b1>   DW_AT_const_value : 0
 <2><5b2>: Abbrev Number: 17 (DW_TAG_enumerator)
    <5b3>   DW_AT_name        : (indirect string, offset: 0x1282e): HAL_UART_STATE_READY
    <5b7>   DW_AT_const_value : 32
 <2><5b8>: Abbrev Number: 17 (DW_TAG_enumerator)
    <5b9>   DW_AT_name        : (indirect string, offset: 0x8bdf1): HAL_UART_STATE_BUSY
    <5bd>   DW_AT_const_value : 36
 <2><5be>: Abbrev Number: 17 (DW_TAG_enumerator)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x1e16): HAL_UART_STATE_BUSY_TX
    <5c3>   DW_AT_const_value : 33
 <2><5c4>: Abbrev Number: 17 (DW_TAG_enumerator)
    <5c5>   DW_AT_name        : (indirect string, offset: 0x16ad): HAL_UART_STATE_BUSY_RX
    <5c9>   DW_AT_const_value : 34
 <2><5ca>: Abbrev Number: 17 (DW_TAG_enumerator)
    <5cb>   DW_AT_name        : (indirect string, offset: 0x23e42): HAL_UART_STATE_BUSY_TX_RX
    <5cf>   DW_AT_const_value : 35
 <2><5d0>: Abbrev Number: 17 (DW_TAG_enumerator)
    <5d1>   DW_AT_name        : (indirect string, offset: 0x4ce9a): HAL_UART_STATE_TIMEOUT
    <5d5>   DW_AT_const_value : 160
 <2><5d6>: Abbrev Number: 17 (DW_TAG_enumerator)
    <5d7>   DW_AT_name        : (indirect string, offset: 0x9a7f2): HAL_UART_STATE_ERROR
    <5db>   DW_AT_const_value : 224
 <2><5dc>: Abbrev Number: 0
 <1><5dd>: Abbrev Number: 3 (DW_TAG_typedef)
    <5de>   DW_AT_name        : (indirect string, offset: 0x30238): HAL_UART_StateTypeDef
    <5e2>   DW_AT_decl_file   : 13
    <5e3>   DW_AT_decl_line   : 135
    <5e4>   DW_AT_decl_column : 3
    <5e5>   DW_AT_type        : <0x59e>
 <1><5e9>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <5ea>   DW_AT_type        : <0x5dd>
 <1><5ee>: Abbrev Number: 3 (DW_TAG_typedef)
    <5ef>   DW_AT_name        : (indirect string, offset: 0x4098e): HAL_UART_RxTypeTypeDef
    <5f3>   DW_AT_decl_file   : 13
    <5f4>   DW_AT_decl_line   : 144
    <5f5>   DW_AT_decl_column : 18
    <5f6>   DW_AT_type        : <0xb5>
 <1><5fa>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <5fb>   DW_AT_type        : <0x5ee>
 <1><5ff>: Abbrev Number: 18 (DW_TAG_structure_type)
    <600>   DW_AT_name        : (indirect string, offset: 0x5bdae): __UART_HandleTypeDef
    <604>   DW_AT_byte_size   : 116
    <605>   DW_AT_decl_file   : 13
    <606>   DW_AT_decl_line   : 149
    <607>   DW_AT_decl_column : 16
    <608>   DW_AT_sibling     : <0x76c>
 <2><60c>: Abbrev Number: 11 (DW_TAG_member)
    <60d>   DW_AT_name        : (indirect string, offset: 0x3d5c2): Instance
    <611>   DW_AT_decl_file   : 13
    <612>   DW_AT_decl_line   : 151
    <613>   DW_AT_decl_column : 34
    <614>   DW_AT_type        : <0x76c>
    <618>   DW_AT_data_member_location: 0
 <2><619>: Abbrev Number: 11 (DW_TAG_member)
    <61a>   DW_AT_name        : (indirect string, offset: 0xa2513): Init
    <61e>   DW_AT_decl_file   : 13
    <61f>   DW_AT_decl_line   : 153
    <620>   DW_AT_decl_column : 33
    <621>   DW_AT_type        : <0x592>
    <625>   DW_AT_data_member_location: 4
 <2><626>: Abbrev Number: 11 (DW_TAG_member)
    <627>   DW_AT_name        : (indirect string, offset: 0x4bc83): pTxBuffPtr
    <62b>   DW_AT_decl_file   : 13
    <62c>   DW_AT_decl_line   : 155
    <62d>   DW_AT_decl_column : 34
    <62e>   DW_AT_type        : <0x772>
    <632>   DW_AT_data_member_location: 32
 <2><633>: Abbrev Number: 11 (DW_TAG_member)
    <634>   DW_AT_name        : (indirect string, offset: 0x4a62): TxXferSize
    <638>   DW_AT_decl_file   : 13
    <639>   DW_AT_decl_line   : 157
    <63a>   DW_AT_decl_column : 33
    <63b>   DW_AT_type        : <0xa4>
    <63f>   DW_AT_data_member_location: 36
 <2><640>: Abbrev Number: 11 (DW_TAG_member)
    <641>   DW_AT_name        : (indirect string, offset: 0xa4954): TxXferCount
    <645>   DW_AT_decl_file   : 13
    <646>   DW_AT_decl_line   : 159
    <647>   DW_AT_decl_column : 33
    <648>   DW_AT_type        : <0xb0>
    <64c>   DW_AT_data_member_location: 38
 <2><64d>: Abbrev Number: 11 (DW_TAG_member)
    <64e>   DW_AT_name        : (indirect string, offset: 0x92b38): pRxBuffPtr
    <652>   DW_AT_decl_file   : 13
    <653>   DW_AT_decl_line   : 161
    <654>   DW_AT_decl_column : 34
    <655>   DW_AT_type        : <0x527>
    <659>   DW_AT_data_member_location: 40
 <2><65a>: Abbrev Number: 11 (DW_TAG_member)
    <65b>   DW_AT_name        : (indirect string, offset: 0x4ec80): RxXferSize
    <65f>   DW_AT_decl_file   : 13
    <660>   DW_AT_decl_line   : 163
    <661>   DW_AT_decl_column : 33
    <662>   DW_AT_type        : <0xa4>
    <666>   DW_AT_data_member_location: 44
 <2><667>: Abbrev Number: 11 (DW_TAG_member)
    <668>   DW_AT_name        : (indirect string, offset: 0x5ee21): RxXferCount
    <66c>   DW_AT_decl_file   : 13
    <66d>   DW_AT_decl_line   : 165
    <66e>   DW_AT_decl_column : 33
    <66f>   DW_AT_type        : <0xb0>
    <673>   DW_AT_data_member_location: 46
 <2><674>: Abbrev Number: 11 (DW_TAG_member)
    <675>   DW_AT_name        : (indirect string, offset: 0x83f53): ReceptionType
    <679>   DW_AT_decl_file   : 13
    <67a>   DW_AT_decl_line   : 167
    <67b>   DW_AT_decl_column : 31
    <67c>   DW_AT_type        : <0x5fa>
    <680>   DW_AT_data_member_location: 48
 <2><681>: Abbrev Number: 11 (DW_TAG_member)
    <682>   DW_AT_name        : (indirect string, offset: 0x99c98): hdmatx
    <686>   DW_AT_decl_file   : 13
    <687>   DW_AT_decl_line   : 169
    <688>   DW_AT_decl_column : 34
    <689>   DW_AT_type        : <0x521>
    <68d>   DW_AT_data_member_location: 52
 <2><68e>: Abbrev Number: 11 (DW_TAG_member)
    <68f>   DW_AT_name        : (indirect string, offset: 0x9930a): hdmarx
    <693>   DW_AT_decl_file   : 13
    <694>   DW_AT_decl_line   : 171
    <695>   DW_AT_decl_column : 34
    <696>   DW_AT_type        : <0x521>
    <69a>   DW_AT_data_member_location: 56
 <2><69b>: Abbrev Number: 11 (DW_TAG_member)
    <69c>   DW_AT_name        : (indirect string, offset: 0xa21c2): Lock
    <6a0>   DW_AT_decl_file   : 13
    <6a1>   DW_AT_decl_line   : 173
    <6a2>   DW_AT_decl_column : 33
    <6a3>   DW_AT_type        : <0x332>
    <6a7>   DW_AT_data_member_location: 60
 <2><6a8>: Abbrev Number: 11 (DW_TAG_member)
    <6a9>   DW_AT_name        : (indirect string, offset: 0x40216): gState
    <6ad>   DW_AT_decl_file   : 13
    <6ae>   DW_AT_decl_line   : 175
    <6af>   DW_AT_decl_column : 33
    <6b0>   DW_AT_type        : <0x5e9>
    <6b4>   DW_AT_data_member_location: 61
 <2><6b5>: Abbrev Number: 11 (DW_TAG_member)
    <6b6>   DW_AT_name        : (indirect string, offset: 0x8e375): RxState
    <6ba>   DW_AT_decl_file   : 13
    <6bb>   DW_AT_decl_line   : 179
    <6bc>   DW_AT_decl_column : 33
    <6bd>   DW_AT_type        : <0x5e9>
    <6c1>   DW_AT_data_member_location: 62
 <2><6c2>: Abbrev Number: 11 (DW_TAG_member)
    <6c3>   DW_AT_name        : (indirect string, offset: 0xa2002): ErrorCode
    <6c7>   DW_AT_decl_file   : 13
    <6c8>   DW_AT_decl_line   : 182
    <6c9>   DW_AT_decl_column : 33
    <6ca>   DW_AT_type        : <0xc1>
    <6ce>   DW_AT_data_member_location: 64
 <2><6cf>: Abbrev Number: 11 (DW_TAG_member)
    <6d0>   DW_AT_name        : (indirect string, offset: 0xa4579): TxHalfCpltCallback
    <6d4>   DW_AT_decl_file   : 13
    <6d5>   DW_AT_decl_line   : 185
    <6d6>   DW_AT_decl_column : 11
    <6d7>   DW_AT_type        : <0x789>
    <6db>   DW_AT_data_member_location: 68
 <2><6dc>: Abbrev Number: 11 (DW_TAG_member)
    <6dd>   DW_AT_name        : (indirect string, offset: 0xa46b7): TxCpltCallback
    <6e1>   DW_AT_decl_file   : 13
    <6e2>   DW_AT_decl_line   : 186
    <6e3>   DW_AT_decl_column : 11
    <6e4>   DW_AT_type        : <0x789>
    <6e8>   DW_AT_data_member_location: 72
 <2><6e9>: Abbrev Number: 11 (DW_TAG_member)
    <6ea>   DW_AT_name        : (indirect string, offset: 0xa4939): RxHalfCpltCallback
    <6ee>   DW_AT_decl_file   : 13
    <6ef>   DW_AT_decl_line   : 187
    <6f0>   DW_AT_decl_column : 11
    <6f1>   DW_AT_type        : <0x789>
    <6f5>   DW_AT_data_member_location: 76
 <2><6f6>: Abbrev Number: 11 (DW_TAG_member)
    <6f7>   DW_AT_name        : (indirect string, offset: 0xa4594): RxCpltCallback
    <6fb>   DW_AT_decl_file   : 13
    <6fc>   DW_AT_decl_line   : 188
    <6fd>   DW_AT_decl_column : 11
    <6fe>   DW_AT_type        : <0x789>
    <702>   DW_AT_data_member_location: 80
 <2><703>: Abbrev Number: 11 (DW_TAG_member)
    <704>   DW_AT_name        : (indirect string, offset: 0xa33b5): ErrorCallback
    <708>   DW_AT_decl_file   : 13
    <709>   DW_AT_decl_line   : 189
    <70a>   DW_AT_decl_column : 11
    <70b>   DW_AT_type        : <0x789>
    <70f>   DW_AT_data_member_location: 84
 <2><710>: Abbrev Number: 11 (DW_TAG_member)
    <711>   DW_AT_name        : (indirect string, offset: 0xa2f7d): AbortCpltCallback
    <715>   DW_AT_decl_file   : 13
    <716>   DW_AT_decl_line   : 190
    <717>   DW_AT_decl_column : 11
    <718>   DW_AT_type        : <0x789>
    <71c>   DW_AT_data_member_location: 88
 <2><71d>: Abbrev Number: 11 (DW_TAG_member)
    <71e>   DW_AT_name        : (indirect string, offset: 0xa665e): AbortTransmitCpltCallback
    <722>   DW_AT_decl_file   : 13
    <723>   DW_AT_decl_line   : 191
    <724>   DW_AT_decl_column : 11
    <725>   DW_AT_type        : <0x789>
    <729>   DW_AT_data_member_location: 92
 <2><72a>: Abbrev Number: 11 (DW_TAG_member)
    <72b>   DW_AT_name        : (indirect string, offset: 0xa6059): AbortReceiveCpltCallback
    <72f>   DW_AT_decl_file   : 13
    <730>   DW_AT_decl_line   : 192
    <731>   DW_AT_decl_column : 11
    <732>   DW_AT_type        : <0x789>
    <736>   DW_AT_data_member_location: 96
 <2><737>: Abbrev Number: 11 (DW_TAG_member)
    <738>   DW_AT_name        : (indirect string, offset: 0x59dd0): WakeupCallback
    <73c>   DW_AT_decl_file   : 13
    <73d>   DW_AT_decl_line   : 193
    <73e>   DW_AT_decl_column : 11
    <73f>   DW_AT_type        : <0x789>
    <743>   DW_AT_data_member_location: 100
 <2><744>: Abbrev Number: 11 (DW_TAG_member)
    <745>   DW_AT_name        : (indirect string, offset: 0xa64a2): RxEventCallback
    <749>   DW_AT_decl_file   : 13
    <74a>   DW_AT_decl_line   : 194
    <74b>   DW_AT_decl_column : 11
    <74c>   DW_AT_type        : <0x79f>
    <750>   DW_AT_data_member_location: 104
 <2><751>: Abbrev Number: 11 (DW_TAG_member)
    <752>   DW_AT_name        : (indirect string, offset: 0x9facd): MspInitCallback
    <756>   DW_AT_decl_file   : 13
    <757>   DW_AT_decl_line   : 196
    <758>   DW_AT_decl_column : 11
    <759>   DW_AT_type        : <0x789>
    <75d>   DW_AT_data_member_location: 108
 <2><75e>: Abbrev Number: 11 (DW_TAG_member)
    <75f>   DW_AT_name        : (indirect string, offset: 0x9fdcc): MspDeInitCallback
    <763>   DW_AT_decl_file   : 13
    <764>   DW_AT_decl_line   : 197
    <765>   DW_AT_decl_column : 11
    <766>   DW_AT_type        : <0x789>
    <76a>   DW_AT_data_member_location: 112
 <2><76b>: Abbrev Number: 0
 <1><76c>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <76d>   DW_AT_byte_size   : 4
    <76e>   DW_AT_type        : <0x2d7>
 <1><772>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <773>   DW_AT_byte_size   : 4
    <774>   DW_AT_type        : <0x9f>
 <1><778>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <779>   DW_AT_prototyped  : 1
    <779>   DW_AT_sibling     : <0x783>
 <2><77d>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <77e>   DW_AT_type        : <0x783>
 <2><782>: Abbrev Number: 0
 <1><783>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <784>   DW_AT_byte_size   : 4
    <785>   DW_AT_type        : <0x5ff>
 <1><789>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <78a>   DW_AT_byte_size   : 4
    <78b>   DW_AT_type        : <0x778>
 <1><78f>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <790>   DW_AT_prototyped  : 1
    <790>   DW_AT_sibling     : <0x79f>
 <2><794>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <795>   DW_AT_type        : <0x783>
 <2><799>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <79a>   DW_AT_type        : <0xa4>
 <2><79e>: Abbrev Number: 0
 <1><79f>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <7a0>   DW_AT_byte_size   : 4
    <7a1>   DW_AT_type        : <0x78f>
 <1><7a5>: Abbrev Number: 3 (DW_TAG_typedef)
    <7a6>   DW_AT_name        : (indirect string, offset: 0x5bdb0): UART_HandleTypeDef
    <7aa>   DW_AT_decl_file   : 13
    <7ab>   DW_AT_decl_line   : 200
    <7ac>   DW_AT_decl_column : 3
    <7ad>   DW_AT_type        : <0x5ff>
 <1><7b1>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <7b2>   DW_AT_byte_size   : 4
    <7b3>   DW_AT_type        : <0x7a5>
 <1><7b7>: Abbrev Number: 8 (DW_TAG_variable)
    <7b8>   DW_AT_name        : (indirect string, offset: 0x54cf0): huart1
    <7bc>   DW_AT_decl_file   : 14
    <7bd>   DW_AT_decl_line   : 35
    <7be>   DW_AT_decl_column : 27
    <7bf>   DW_AT_type        : <0x7a5>
    <7c3>   DW_AT_external    : 1
    <7c3>   DW_AT_declaration : 1
 <1><7c3>: Abbrev Number: 22 (DW_TAG_variable)
    <7c4>   DW_AT_specification: <0xee>
    <7c8>   DW_AT_decl_file   : 1
    <7c9>   DW_AT_decl_line   : 8
    <7ca>   DW_AT_decl_column : 7
    <7cb>   DW_AT_location    : 5 byte block: 3 28 0 0 20 	(DW_OP_addr: 20000028)
 <1><7d1>: Abbrev Number: 23 (DW_TAG_subprogram)
    <7d2>   DW_AT_external    : 1
    <7d2>   DW_AT_name        : (indirect string, offset: 0x503d2): HAL_UART_Receive_IT
    <7d6>   DW_AT_decl_file   : 13
    <7d7>   DW_AT_decl_line   : 725
    <7d9>   DW_AT_decl_column : 19
    <7da>   DW_AT_prototyped  : 1
    <7da>   DW_AT_type        : <0x30b>
    <7de>   DW_AT_declaration : 1
    <7de>   DW_AT_sibling     : <0x7f2>
 <2><7e2>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <7e3>   DW_AT_type        : <0x7b1>
 <2><7e7>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <7e8>   DW_AT_type        : <0x527>
 <2><7ec>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <7ed>   DW_AT_type        : <0xa4>
 <2><7f1>: Abbrev Number: 0
 <1><7f2>: Abbrev Number: 24 (DW_TAG_subprogram)
    <7f3>   DW_AT_external    : 1
    <7f3>   DW_AT_name        : (indirect string, offset: 0x6a892): BtcMainFunction
    <7f7>   DW_AT_decl_file   : 1
    <7f8>   DW_AT_decl_line   : 323
    <7fa>   DW_AT_decl_column : 6
    <7fb>   DW_AT_low_pc      : 0x0
    <7ff>   DW_AT_high_pc     : 0x10
    <803>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <805>   DW_AT_GNU_all_tail_call_sites: 1
 <1><805>: Abbrev Number: 25 (DW_TAG_subprogram)
    <806>   DW_AT_external    : 1
    <806>   DW_AT_name        : (indirect string, offset: 0x4033e): BtcEnableUart
    <80a>   DW_AT_decl_file   : 1
    <80b>   DW_AT_decl_line   : 300
    <80d>   DW_AT_decl_column : 15
    <80e>   DW_AT_type        : <0xe2>
    <812>   DW_AT_low_pc      : 0x0
    <816>   DW_AT_high_pc     : 0x50
    <81a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <81c>   DW_AT_GNU_all_tail_call_sites: 1
    <81c>   DW_AT_sibling     : <0x831>
 <2><820>: Abbrev Number: 26 (DW_TAG_variable)
    <821>   DW_AT_name        : (indirect string, offset: 0xa1251): status
    <825>   DW_AT_decl_file   : 1
    <826>   DW_AT_decl_line   : 303
    <828>   DW_AT_decl_column : 8
    <829>   DW_AT_type        : <0xd6>
    <82d>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><830>: Abbrev Number: 0
 <1><831>: Abbrev Number: 27 (DW_TAG_subprogram)
    <832>   DW_AT_external    : 1
    <832>   DW_AT_name        : (indirect string, offset: 0x5eea3): BtcRxVal
    <836>   DW_AT_decl_file   : 1
    <837>   DW_AT_decl_line   : 25
    <838>   DW_AT_decl_column : 15
    <839>   DW_AT_type        : <0xe2>
    <83d>   DW_AT_low_pc      : 0x0
    <841>   DW_AT_high_pc     : 0x570
    <845>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <847>   DW_AT_GNU_all_call_sites: 1
 <1><847>: Abbrev Number: 27 (DW_TAG_subprogram)
    <848>   DW_AT_external    : 1
    <848>   DW_AT_name        : (indirect string, offset: 0x4a909): BtcInit
    <84c>   DW_AT_decl_file   : 1
    <84d>   DW_AT_decl_line   : 16
    <84e>   DW_AT_decl_column : 15
    <84f>   DW_AT_type        : <0xe2>
    <853>   DW_AT_low_pc      : 0x0
    <857>   DW_AT_high_pc     : 0x1c
    <85b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <85d>   DW_AT_GNU_all_call_sites: 1
 <1><85d>: Abbrev Number: 0
  Compilation Unit @ offset 0x85e:
   Length:        0xd1d (32-bit)
   Version:       4
   Abbrev Offset: 0x1a0
   Pointer Size:  4
 <0><869>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <86a>   DW_AT_producer    : (indirect string, offset: 0x9bca4): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <86e>   DW_AT_language    : 12	(ANSI C99)
    <86f>   DW_AT_name        : (indirect string, offset: 0x9f063): ../Core/Src/adc.c
    <873>   DW_AT_comp_dir    : (indirect string, offset: 0x6584d): C:/Users/Daniel/Documents/BMWI4/I4_BCC_WORKSPACE/I4_BCC/Debug
    <877>   DW_AT_ranges      : 0x28
    <87b>   DW_AT_low_pc      : 0x0
    <87f>   DW_AT_stmt_list   : 0xd4e
    <883>   DW_AT_GNU_macros  : 0x16b06
 <1><887>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <888>   DW_AT_encoding    : 5	(signed)
    <889>   DW_AT_byte_size   : 1
    <88a>   DW_AT_type        : <0xa1c>
    <88e>   DW_AT_decl_file   : 2
    <88f>   DW_AT_decl_line   : 66
    <890>   DW_AT_decl_column : 1
    <891>   DW_AT_sibling     : <0xa1c>
 <2><895>: Abbrev Number: 3 (DW_TAG_enumerator)
    <896>   DW_AT_name        : (indirect string, offset: 0x9f19e): NonMaskableInt_IRQn
    <89a>   DW_AT_const_value : -14
 <2><89b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <89c>   DW_AT_name        : (indirect string, offset: 0x9efc1): MemoryManagement_IRQn
    <8a0>   DW_AT_const_value : -12
 <2><8a1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <8a2>   DW_AT_name        : (indirect string, offset: 0x9f0b6): BusFault_IRQn
    <8a6>   DW_AT_const_value : -11
 <2><8a7>: Abbrev Number: 3 (DW_TAG_enumerator)
    <8a8>   DW_AT_name        : (indirect string, offset: 0x9f18e): UsageFault_IRQn
    <8ac>   DW_AT_const_value : -10
 <2><8ad>: Abbrev Number: 3 (DW_TAG_enumerator)
    <8ae>   DW_AT_name        : (indirect string, offset: 0x9eb87): SVCall_IRQn
    <8b2>   DW_AT_const_value : -5
 <2><8b3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <8b4>   DW_AT_name        : (indirect string, offset: 0x9eeda): DebugMonitor_IRQn
    <8b8>   DW_AT_const_value : -4
 <2><8b9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <8ba>   DW_AT_name        : (indirect string, offset: 0x9ef36): PendSV_IRQn
    <8be>   DW_AT_const_value : -2
 <2><8bf>: Abbrev Number: 3 (DW_TAG_enumerator)
    <8c0>   DW_AT_name        : (indirect string, offset: 0x9f0f1): SysTick_IRQn
    <8c4>   DW_AT_const_value : -1
 <2><8c5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8c6>   DW_AT_name        : (indirect string, offset: 0x9f028): WWDG_IRQn
    <8ca>   DW_AT_const_value : 0
 <2><8cb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8cc>   DW_AT_name        : (indirect string, offset: 0x9ec89): PVD_IRQn
    <8d0>   DW_AT_const_value : 1
 <2><8d1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8d2>   DW_AT_name        : (indirect string, offset: 0x9f239): TAMP_STAMP_IRQn
    <8d6>   DW_AT_const_value : 2
 <2><8d7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8d8>   DW_AT_name        : (indirect string, offset: 0x9ef6c): RTC_WKUP_IRQn
    <8dc>   DW_AT_const_value : 3
 <2><8dd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8de>   DW_AT_name        : (indirect string, offset: 0x9ecd7): FLASH_IRQn
    <8e2>   DW_AT_const_value : 4
 <2><8e3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8e4>   DW_AT_name        : (indirect string, offset: 0x9f0ad): RCC_IRQn
    <8e8>   DW_AT_const_value : 5
 <2><8e9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8ea>   DW_AT_name        : (indirect string, offset: 0x9eeec): EXTI0_IRQn
    <8ee>   DW_AT_const_value : 6
 <2><8ef>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8f0>   DW_AT_name        : (indirect string, offset: 0x9f226): EXTI1_IRQn
    <8f4>   DW_AT_const_value : 7
 <2><8f5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8f6>   DW_AT_name        : (indirect string, offset: 0x9eeb1): EXTI2_IRQn
    <8fa>   DW_AT_const_value : 8
 <2><8fb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8fc>   DW_AT_name        : (indirect string, offset: 0x9f0fe): EXTI3_IRQn
    <900>   DW_AT_const_value : 9
 <2><901>: Abbrev Number: 4 (DW_TAG_enumerator)
    <902>   DW_AT_name        : (indirect string, offset: 0x9ed32): EXTI4_IRQn
    <906>   DW_AT_const_value : 10
 <2><907>: Abbrev Number: 4 (DW_TAG_enumerator)
    <908>   DW_AT_name        : (indirect string, offset: 0x9f016): DMA1_Stream0_IRQn
    <90c>   DW_AT_const_value : 11
 <2><90d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <90e>   DW_AT_name        : (indirect string, offset: 0x9f26a): DMA1_Stream1_IRQn
    <912>   DW_AT_const_value : 12
 <2><913>: Abbrev Number: 4 (DW_TAG_enumerator)
    <914>   DW_AT_name        : (indirect string, offset: 0x9ee51): DMA1_Stream2_IRQn
    <918>   DW_AT_const_value : 13
 <2><919>: Abbrev Number: 4 (DW_TAG_enumerator)
    <91a>   DW_AT_name        : (indirect string, offset: 0x9ed94): DMA1_Stream3_IRQn
    <91e>   DW_AT_const_value : 14
 <2><91f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <920>   DW_AT_name        : (indirect string, offset: 0x9ed5a): DMA1_Stream4_IRQn
    <924>   DW_AT_const_value : 15
 <2><925>: Abbrev Number: 4 (DW_TAG_enumerator)
    <926>   DW_AT_name        : (indirect string, offset: 0x9f075): DMA1_Stream5_IRQn
    <92a>   DW_AT_const_value : 16
 <2><92b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <92c>   DW_AT_name        : (indirect string, offset: 0x9ecb4): DMA1_Stream6_IRQn
    <930>   DW_AT_const_value : 17
 <2><931>: Abbrev Number: 4 (DW_TAG_enumerator)
    <932>   DW_AT_name        : (indirect string, offset: 0x9ef01): ADC_IRQn
    <936>   DW_AT_const_value : 18
 <2><937>: Abbrev Number: 4 (DW_TAG_enumerator)
    <938>   DW_AT_name        : (indirect string, offset: 0x9eb93): EXTI9_5_IRQn
    <93c>   DW_AT_const_value : 23
 <2><93d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <93e>   DW_AT_name        : (indirect string, offset: 0x9ee2b): TIM1_BRK_TIM9_IRQn
    <942>   DW_AT_const_value : 24
 <2><943>: Abbrev Number: 4 (DW_TAG_enumerator)
    <944>   DW_AT_name        : (indirect string, offset: 0x9ef59): TIM1_UP_TIM10_IRQn
    <948>   DW_AT_const_value : 25
 <2><949>: Abbrev Number: 4 (DW_TAG_enumerator)
    <94a>   DW_AT_name        : (indirect string, offset: 0x9f032): TIM1_TRG_COM_TIM11_IRQn
    <94e>   DW_AT_const_value : 26
 <2><94f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <950>   DW_AT_name        : (indirect string, offset: 0x9eda6): TIM1_CC_IRQn
    <954>   DW_AT_const_value : 27
 <2><955>: Abbrev Number: 4 (DW_TAG_enumerator)
    <956>   DW_AT_name        : (indirect string, offset: 0x9ec20): TIM2_IRQn
    <95a>   DW_AT_const_value : 28
 <2><95b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <95c>   DW_AT_name        : (indirect string, offset: 0x9f1bf): TIM3_IRQn
    <960>   DW_AT_const_value : 29
 <2><961>: Abbrev Number: 4 (DW_TAG_enumerator)
    <962>   DW_AT_name        : (indirect string, offset: 0x9edbc): TIM4_IRQn
    <966>   DW_AT_const_value : 30
 <2><967>: Abbrev Number: 4 (DW_TAG_enumerator)
    <968>   DW_AT_name        : (indirect string, offset: 0x9edd1): I2C1_EV_IRQn
    <96c>   DW_AT_const_value : 31
 <2><96d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <96e>   DW_AT_name        : (indirect string, offset: 0x9efa7): I2C1_ER_IRQn
    <972>   DW_AT_const_value : 32
 <2><973>: Abbrev Number: 4 (DW_TAG_enumerator)
    <974>   DW_AT_name        : (indirect string, offset: 0x9ec00): I2C2_EV_IRQn
    <978>   DW_AT_const_value : 33
 <2><979>: Abbrev Number: 4 (DW_TAG_enumerator)
    <97a>   DW_AT_name        : (indirect string, offset: 0x9edf6): I2C2_ER_IRQn
    <97e>   DW_AT_const_value : 34
 <2><97f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <980>   DW_AT_name        : (indirect string, offset: 0x9ec0d): SPI1_IRQn
    <984>   DW_AT_const_value : 35
 <2><985>: Abbrev Number: 4 (DW_TAG_enumerator)
    <986>   DW_AT_name        : (indirect string, offset: 0x9f002): SPI2_IRQn
    <98a>   DW_AT_const_value : 36
 <2><98b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <98c>   DW_AT_name        : (indirect string, offset: 0x9f0cb): USART1_IRQn
    <990>   DW_AT_const_value : 37
 <2><991>: Abbrev Number: 4 (DW_TAG_enumerator)
    <992>   DW_AT_name        : (indirect string, offset: 0x9ecfb): USART2_IRQn
    <996>   DW_AT_const_value : 38
 <2><997>: Abbrev Number: 4 (DW_TAG_enumerator)
    <998>   DW_AT_name        : (indirect string, offset: 0x9f11e): EXTI15_10_IRQn
    <99c>   DW_AT_const_value : 40
 <2><99d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <99e>   DW_AT_name        : (indirect string, offset: 0x9f12d): RTC_Alarm_IRQn
    <9a2>   DW_AT_const_value : 41
 <2><9a3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9a4>   DW_AT_name        : (indirect string, offset: 0x9ecc6): OTG_FS_WKUP_IRQn
    <9a8>   DW_AT_const_value : 42
 <2><9a9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9aa>   DW_AT_name        : (indirect string, offset: 0x9ef87): DMA1_Stream7_IRQn
    <9ae>   DW_AT_const_value : 47
 <2><9af>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9b0>   DW_AT_name        : (indirect string, offset: 0x35ed3): SDIO_IRQn
    <9b4>   DW_AT_const_value : 49
 <2><9b5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9b6>   DW_AT_name        : (indirect string, offset: 0x9ee6d): TIM5_IRQn
    <9ba>   DW_AT_const_value : 50
 <2><9bb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9bc>   DW_AT_name        : (indirect string, offset: 0x9f27c): SPI3_IRQn
    <9c0>   DW_AT_const_value : 51
 <2><9c1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c2>   DW_AT_name        : (indirect string, offset: 0x9efe6): DMA2_Stream0_IRQn
    <9c6>   DW_AT_const_value : 56
 <2><9c7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9c8>   DW_AT_name        : (indirect string, offset: 0x9ec33): DMA2_Stream1_IRQn
    <9cc>   DW_AT_const_value : 57
 <2><9cd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9ce>   DW_AT_name        : (indirect string, offset: 0x9ef14): DMA2_Stream2_IRQn
    <9d2>   DW_AT_const_value : 58
 <2><9d3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9d4>   DW_AT_name        : (indirect string, offset: 0x9f286): DMA2_Stream3_IRQn
    <9d8>   DW_AT_const_value : 59
 <2><9d9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9da>   DW_AT_name        : (indirect string, offset: 0x9ee77): DMA2_Stream4_IRQn
    <9de>   DW_AT_const_value : 60
 <2><9df>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9e0>   DW_AT_name        : (indirect string, offset: 0x9ef4d): OTG_FS_IRQn
    <9e4>   DW_AT_const_value : 67
 <2><9e5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9e6>   DW_AT_name        : (indirect string, offset: 0x9f13c): DMA2_Stream5_IRQn
    <9ea>   DW_AT_const_value : 68
 <2><9eb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9ec>   DW_AT_name        : (indirect string, offset: 0x9ed82): DMA2_Stream6_IRQn
    <9f0>   DW_AT_const_value : 69
 <2><9f1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9f2>   DW_AT_name        : (indirect string, offset: 0x9f087): DMA2_Stream7_IRQn
    <9f6>   DW_AT_const_value : 70
 <2><9f7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x9ee19): USART6_IRQn
    <9fc>   DW_AT_const_value : 71
 <2><9fd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9fe>   DW_AT_name        : (indirect string, offset: 0x9f1b2): I2C3_EV_IRQn
    <a02>   DW_AT_const_value : 72
 <2><a03>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a04>   DW_AT_name        : (indirect string, offset: 0x9ec92): I2C3_ER_IRQn
    <a08>   DW_AT_const_value : 73
 <2><a09>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a0a>   DW_AT_name        : (indirect string, offset: 0x9edb3): FPU_IRQn
    <a0e>   DW_AT_const_value : 81
 <2><a0f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a10>   DW_AT_name        : (indirect string, offset: 0x9ee63): SPI4_IRQn
    <a14>   DW_AT_const_value : 84
 <2><a15>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a16>   DW_AT_name        : (indirect string, offset: 0x9f184): SPI5_IRQn
    <a1a>   DW_AT_const_value : 85
 <2><a1b>: Abbrev Number: 0
 <1><a1c>: Abbrev Number: 5 (DW_TAG_base_type)
    <a1d>   DW_AT_byte_size   : 1
    <a1e>   DW_AT_encoding    : 6	(signed char)
    <a1f>   DW_AT_name        : (indirect string, offset: 0x4f4c0): signed char
 <1><a23>: Abbrev Number: 6 (DW_TAG_typedef)
    <a24>   DW_AT_name        : (indirect string, offset: 0x9f16b): IRQn_Type
    <a28>   DW_AT_decl_file   : 2
    <a29>   DW_AT_decl_line   : 134
    <a2a>   DW_AT_decl_column : 3
    <a2b>   DW_AT_type        : <0x887>
 <1><a2f>: Abbrev Number: 5 (DW_TAG_base_type)
    <a30>   DW_AT_byte_size   : 1
    <a31>   DW_AT_encoding    : 8	(unsigned char)
    <a32>   DW_AT_name        : (indirect string, offset: 0x20ad1): unsigned char
 <1><a36>: Abbrev Number: 5 (DW_TAG_base_type)
    <a37>   DW_AT_byte_size   : 2
    <a38>   DW_AT_encoding    : 5	(signed)
    <a39>   DW_AT_name        : (indirect string, offset: 0x75e5f): short int
 <1><a3d>: Abbrev Number: 6 (DW_TAG_typedef)
    <a3e>   DW_AT_name        : (indirect string, offset: 0x81086): __uint16_t
    <a42>   DW_AT_decl_file   : 3
    <a43>   DW_AT_decl_line   : 57
    <a44>   DW_AT_decl_column : 25
    <a45>   DW_AT_type        : <0xa49>
 <1><a49>: Abbrev Number: 5 (DW_TAG_base_type)
    <a4a>   DW_AT_byte_size   : 2
    <a4b>   DW_AT_encoding    : 7	(unsigned)
    <a4c>   DW_AT_name        : (indirect string, offset: 0x97286): short unsigned int
 <1><a50>: Abbrev Number: 5 (DW_TAG_base_type)
    <a51>   DW_AT_byte_size   : 4
    <a52>   DW_AT_encoding    : 5	(signed)
    <a53>   DW_AT_name        : (indirect string, offset: 0xd34a): long int
 <1><a57>: Abbrev Number: 6 (DW_TAG_typedef)
    <a58>   DW_AT_name        : (indirect string, offset: 0x64675): __uint32_t
    <a5c>   DW_AT_decl_file   : 3
    <a5d>   DW_AT_decl_line   : 79
    <a5e>   DW_AT_decl_column : 25
    <a5f>   DW_AT_type        : <0xa63>
 <1><a63>: Abbrev Number: 5 (DW_TAG_base_type)
    <a64>   DW_AT_byte_size   : 4
    <a65>   DW_AT_encoding    : 7	(unsigned)
    <a66>   DW_AT_name        : (indirect string, offset: 0x30a5a): long unsigned int
 <1><a6a>: Abbrev Number: 5 (DW_TAG_base_type)
    <a6b>   DW_AT_byte_size   : 8
    <a6c>   DW_AT_encoding    : 5	(signed)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x47cfa): long long int
 <1><a71>: Abbrev Number: 5 (DW_TAG_base_type)
    <a72>   DW_AT_byte_size   : 8
    <a73>   DW_AT_encoding    : 7	(unsigned)
    <a74>   DW_AT_name        : (indirect string, offset: 0x21557): long long unsigned int
 <1><a78>: Abbrev Number: 7 (DW_TAG_base_type)
    <a79>   DW_AT_byte_size   : 4
    <a7a>   DW_AT_encoding    : 5	(signed)
    <a7b>   DW_AT_name        : int
 <1><a7f>: Abbrev Number: 5 (DW_TAG_base_type)
    <a80>   DW_AT_byte_size   : 4
    <a81>   DW_AT_encoding    : 7	(unsigned)
    <a82>   DW_AT_name        : (indirect string, offset: 0xccbf): unsigned int
 <1><a86>: Abbrev Number: 6 (DW_TAG_typedef)
    <a87>   DW_AT_name        : (indirect string, offset: 0x81088): uint16_t
    <a8b>   DW_AT_decl_file   : 4
    <a8c>   DW_AT_decl_line   : 36
    <a8d>   DW_AT_decl_column : 20
    <a8e>   DW_AT_type        : <0xa3d>
 <1><a92>: Abbrev Number: 6 (DW_TAG_typedef)
    <a93>   DW_AT_name        : (indirect string, offset: 0x64677): uint32_t
    <a97>   DW_AT_decl_file   : 4
    <a98>   DW_AT_decl_line   : 48
    <a99>   DW_AT_decl_column : 20
    <a9a>   DW_AT_type        : <0xa57>
 <1><a9e>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <a9f>   DW_AT_type        : <0xa92>
 <1><aa3>: Abbrev Number: 9 (DW_TAG_array_type)
    <aa4>   DW_AT_type        : <0xa92>
    <aa8>   DW_AT_sibling     : <0xab3>
 <2><aac>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <aad>   DW_AT_type        : <0xa7f>
    <ab1>   DW_AT_upper_bound : 0
 <2><ab2>: Abbrev Number: 0
 <1><ab3>: Abbrev Number: 9 (DW_TAG_array_type)
    <ab4>   DW_AT_type        : <0xa92>
    <ab8>   DW_AT_sibling     : <0xac3>
 <2><abc>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <abd>   DW_AT_type        : <0xa7f>
    <ac1>   DW_AT_upper_bound : 1
 <2><ac2>: Abbrev Number: 0
 <1><ac3>: Abbrev Number: 11 (DW_TAG_structure_type)
    <ac4>   DW_AT_byte_size   : 80
    <ac5>   DW_AT_decl_file   : 2
    <ac6>   DW_AT_decl_line   : 152
    <ac7>   DW_AT_decl_column : 9
    <ac8>   DW_AT_sibling     : <0xbcf>
 <2><acc>: Abbrev Number: 12 (DW_TAG_member)
    <acd>   DW_AT_name        : SR
    <ad0>   DW_AT_decl_file   : 2
    <ad1>   DW_AT_decl_line   : 154
    <ad2>   DW_AT_decl_column : 17
    <ad3>   DW_AT_type        : <0xa9e>
    <ad7>   DW_AT_data_member_location: 0
 <2><ad8>: Abbrev Number: 12 (DW_TAG_member)
    <ad9>   DW_AT_name        : CR1
    <add>   DW_AT_decl_file   : 2
    <ade>   DW_AT_decl_line   : 155
    <adf>   DW_AT_decl_column : 17
    <ae0>   DW_AT_type        : <0xa9e>
    <ae4>   DW_AT_data_member_location: 4
 <2><ae5>: Abbrev Number: 12 (DW_TAG_member)
    <ae6>   DW_AT_name        : CR2
    <aea>   DW_AT_decl_file   : 2
    <aeb>   DW_AT_decl_line   : 156
    <aec>   DW_AT_decl_column : 17
    <aed>   DW_AT_type        : <0xa9e>
    <af1>   DW_AT_data_member_location: 8
 <2><af2>: Abbrev Number: 13 (DW_TAG_member)
    <af3>   DW_AT_name        : (indirect string, offset: 0x8daaf): SMPR1
    <af7>   DW_AT_decl_file   : 2
    <af8>   DW_AT_decl_line   : 157
    <af9>   DW_AT_decl_column : 17
    <afa>   DW_AT_type        : <0xa9e>
    <afe>   DW_AT_data_member_location: 12
 <2><aff>: Abbrev Number: 13 (DW_TAG_member)
    <b00>   DW_AT_name        : (indirect string, offset: 0x38672): SMPR2
    <b04>   DW_AT_decl_file   : 2
    <b05>   DW_AT_decl_line   : 158
    <b06>   DW_AT_decl_column : 17
    <b07>   DW_AT_type        : <0xa9e>
    <b0b>   DW_AT_data_member_location: 16
 <2><b0c>: Abbrev Number: 13 (DW_TAG_member)
    <b0d>   DW_AT_name        : (indirect string, offset: 0x9edde): JOFR1
    <b11>   DW_AT_decl_file   : 2
    <b12>   DW_AT_decl_line   : 159
    <b13>   DW_AT_decl_column : 17
    <b14>   DW_AT_type        : <0xa9e>
    <b18>   DW_AT_data_member_location: 20
 <2><b19>: Abbrev Number: 13 (DW_TAG_member)
    <b1a>   DW_AT_name        : (indirect string, offset: 0x9ede4): JOFR2
    <b1e>   DW_AT_decl_file   : 2
    <b1f>   DW_AT_decl_line   : 160
    <b20>   DW_AT_decl_column : 17
    <b21>   DW_AT_type        : <0xa9e>
    <b25>   DW_AT_data_member_location: 24
 <2><b26>: Abbrev Number: 13 (DW_TAG_member)
    <b27>   DW_AT_name        : (indirect string, offset: 0x9edea): JOFR3
    <b2b>   DW_AT_decl_file   : 2
    <b2c>   DW_AT_decl_line   : 161
    <b2d>   DW_AT_decl_column : 17
    <b2e>   DW_AT_type        : <0xa9e>
    <b32>   DW_AT_data_member_location: 28
 <2><b33>: Abbrev Number: 13 (DW_TAG_member)
    <b34>   DW_AT_name        : (indirect string, offset: 0x9edf0): JOFR4
    <b38>   DW_AT_decl_file   : 2
    <b39>   DW_AT_decl_line   : 162
    <b3a>   DW_AT_decl_column : 17
    <b3b>   DW_AT_type        : <0xa9e>
    <b3f>   DW_AT_data_member_location: 32
 <2><b40>: Abbrev Number: 12 (DW_TAG_member)
    <b41>   DW_AT_name        : HTR
    <b45>   DW_AT_decl_file   : 2
    <b46>   DW_AT_decl_line   : 163
    <b47>   DW_AT_decl_column : 17
    <b48>   DW_AT_type        : <0xa9e>
    <b4c>   DW_AT_data_member_location: 36
 <2><b4d>: Abbrev Number: 12 (DW_TAG_member)
    <b4e>   DW_AT_name        : LTR
    <b52>   DW_AT_decl_file   : 2
    <b53>   DW_AT_decl_line   : 164
    <b54>   DW_AT_decl_column : 17
    <b55>   DW_AT_type        : <0xa9e>
    <b59>   DW_AT_data_member_location: 40
 <2><b5a>: Abbrev Number: 13 (DW_TAG_member)
    <b5b>   DW_AT_name        : (indirect string, offset: 0x6dc04): SQR1
    <b5f>   DW_AT_decl_file   : 2
    <b60>   DW_AT_decl_line   : 165
    <b61>   DW_AT_decl_column : 17
    <b62>   DW_AT_type        : <0xa9e>
    <b66>   DW_AT_data_member_location: 44
 <2><b67>: Abbrev Number: 13 (DW_TAG_member)
    <b68>   DW_AT_name        : (indirect string, offset: 0x9ebc6): SQR2
    <b6c>   DW_AT_decl_file   : 2
    <b6d>   DW_AT_decl_line   : 166
    <b6e>   DW_AT_decl_column : 17
    <b6f>   DW_AT_type        : <0xa9e>
    <b73>   DW_AT_data_member_location: 48
 <2><b74>: Abbrev Number: 13 (DW_TAG_member)
    <b75>   DW_AT_name        : (indirect string, offset: 0x9ebcb): SQR3
    <b79>   DW_AT_decl_file   : 2
    <b7a>   DW_AT_decl_line   : 167
    <b7b>   DW_AT_decl_column : 17
    <b7c>   DW_AT_type        : <0xa9e>
    <b80>   DW_AT_data_member_location: 52
 <2><b81>: Abbrev Number: 13 (DW_TAG_member)
    <b82>   DW_AT_name        : (indirect string, offset: 0x798d6): JSQR
    <b86>   DW_AT_decl_file   : 2
    <b87>   DW_AT_decl_line   : 168
    <b88>   DW_AT_decl_column : 17
    <b89>   DW_AT_type        : <0xa9e>
    <b8d>   DW_AT_data_member_location: 56
 <2><b8e>: Abbrev Number: 13 (DW_TAG_member)
    <b8f>   DW_AT_name        : (indirect string, offset: 0x9efd7): JDR1
    <b93>   DW_AT_decl_file   : 2
    <b94>   DW_AT_decl_line   : 169
    <b95>   DW_AT_decl_column : 17
    <b96>   DW_AT_type        : <0xa9e>
    <b9a>   DW_AT_data_member_location: 60
 <2><b9b>: Abbrev Number: 13 (DW_TAG_member)
    <b9c>   DW_AT_name        : (indirect string, offset: 0x9efdc): JDR2
    <ba0>   DW_AT_decl_file   : 2
    <ba1>   DW_AT_decl_line   : 170
    <ba2>   DW_AT_decl_column : 17
    <ba3>   DW_AT_type        : <0xa9e>
    <ba7>   DW_AT_data_member_location: 64
 <2><ba8>: Abbrev Number: 13 (DW_TAG_member)
    <ba9>   DW_AT_name        : (indirect string, offset: 0x9efe1): JDR3
    <bad>   DW_AT_decl_file   : 2
    <bae>   DW_AT_decl_line   : 171
    <baf>   DW_AT_decl_column : 17
    <bb0>   DW_AT_type        : <0xa9e>
    <bb4>   DW_AT_data_member_location: 68
 <2><bb5>: Abbrev Number: 13 (DW_TAG_member)
    <bb6>   DW_AT_name        : (indirect string, offset: 0x9ef0f): JDR4
    <bba>   DW_AT_decl_file   : 2
    <bbb>   DW_AT_decl_line   : 172
    <bbc>   DW_AT_decl_column : 17
    <bbd>   DW_AT_type        : <0xa9e>
    <bc1>   DW_AT_data_member_location: 72
 <2><bc2>: Abbrev Number: 12 (DW_TAG_member)
    <bc3>   DW_AT_name        : DR
    <bc6>   DW_AT_decl_file   : 2
    <bc7>   DW_AT_decl_line   : 173
    <bc8>   DW_AT_decl_column : 17
    <bc9>   DW_AT_type        : <0xa9e>
    <bcd>   DW_AT_data_member_location: 76
 <2><bce>: Abbrev Number: 0
 <1><bcf>: Abbrev Number: 6 (DW_TAG_typedef)
    <bd0>   DW_AT_name        : (indirect string, offset: 0x9f0a1): ADC_TypeDef
    <bd4>   DW_AT_decl_file   : 2
    <bd5>   DW_AT_decl_line   : 174
    <bd6>   DW_AT_decl_column : 3
    <bd7>   DW_AT_type        : <0xac3>
 <1><bdb>: Abbrev Number: 11 (DW_TAG_structure_type)
    <bdc>   DW_AT_byte_size   : 24
    <bdd>   DW_AT_decl_file   : 2
    <bde>   DW_AT_decl_line   : 214
    <bdf>   DW_AT_decl_column : 9
    <be0>   DW_AT_sibling     : <0xc32>
 <2><be4>: Abbrev Number: 12 (DW_TAG_member)
    <be5>   DW_AT_name        : CR
    <be8>   DW_AT_decl_file   : 2
    <be9>   DW_AT_decl_line   : 216
    <bea>   DW_AT_decl_column : 17
    <beb>   DW_AT_type        : <0xa9e>
    <bef>   DW_AT_data_member_location: 0
 <2><bf0>: Abbrev Number: 13 (DW_TAG_member)
    <bf1>   DW_AT_name        : (indirect string, offset: 0x4d857): NDTR
    <bf5>   DW_AT_decl_file   : 2
    <bf6>   DW_AT_decl_line   : 217
    <bf7>   DW_AT_decl_column : 17
    <bf8>   DW_AT_type        : <0xa9e>
    <bfc>   DW_AT_data_member_location: 4
 <2><bfd>: Abbrev Number: 12 (DW_TAG_member)
    <bfe>   DW_AT_name        : PAR
    <c02>   DW_AT_decl_file   : 2
    <c03>   DW_AT_decl_line   : 218
    <c04>   DW_AT_decl_column : 17
    <c05>   DW_AT_type        : <0xa9e>
    <c09>   DW_AT_data_member_location: 8
 <2><c0a>: Abbrev Number: 13 (DW_TAG_member)
    <c0b>   DW_AT_name        : (indirect string, offset: 0x417e7): M0AR
    <c0f>   DW_AT_decl_file   : 2
    <c10>   DW_AT_decl_line   : 219
    <c11>   DW_AT_decl_column : 17
    <c12>   DW_AT_type        : <0xa9e>
    <c16>   DW_AT_data_member_location: 12
 <2><c17>: Abbrev Number: 13 (DW_TAG_member)
    <c18>   DW_AT_name        : (indirect string, offset: 0xee9c): M1AR
    <c1c>   DW_AT_decl_file   : 2
    <c1d>   DW_AT_decl_line   : 220
    <c1e>   DW_AT_decl_column : 17
    <c1f>   DW_AT_type        : <0xa9e>
    <c23>   DW_AT_data_member_location: 16
 <2><c24>: Abbrev Number: 12 (DW_TAG_member)
    <c25>   DW_AT_name        : FCR
    <c29>   DW_AT_decl_file   : 2
    <c2a>   DW_AT_decl_line   : 221
    <c2b>   DW_AT_decl_column : 17
    <c2c>   DW_AT_type        : <0xa9e>
    <c30>   DW_AT_data_member_location: 20
 <2><c31>: Abbrev Number: 0
 <1><c32>: Abbrev Number: 6 (DW_TAG_typedef)
    <c33>   DW_AT_name        : (indirect string, offset: 0x8f7bb): DMA_Stream_TypeDef
    <c37>   DW_AT_decl_file   : 2
    <c38>   DW_AT_decl_line   : 222
    <c39>   DW_AT_decl_column : 3
    <c3a>   DW_AT_type        : <0xbdb>
 <1><c3e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <c3f>   DW_AT_byte_size   : 40
    <c40>   DW_AT_decl_file   : 2
    <c41>   DW_AT_decl_line   : 265
    <c43>   DW_AT_decl_column : 9
    <c44>   DW_AT_sibling     : <0xcc7>
 <2><c48>: Abbrev Number: 15 (DW_TAG_member)
    <c49>   DW_AT_name        : (indirect string, offset: 0x9eb76): MODER
    <c4d>   DW_AT_decl_file   : 2
    <c4e>   DW_AT_decl_line   : 267
    <c50>   DW_AT_decl_column : 17
    <c51>   DW_AT_type        : <0xa9e>
    <c55>   DW_AT_data_member_location: 0
 <2><c56>: Abbrev Number: 15 (DW_TAG_member)
    <c57>   DW_AT_name        : (indirect string, offset: 0x9f0c4): OTYPER
    <c5b>   DW_AT_decl_file   : 2
    <c5c>   DW_AT_decl_line   : 268
    <c5e>   DW_AT_decl_column : 17
    <c5f>   DW_AT_type        : <0xa9e>
    <c63>   DW_AT_data_member_location: 4
 <2><c64>: Abbrev Number: 15 (DW_TAG_member)
    <c65>   DW_AT_name        : (indirect string, offset: 0x9f163): OSPEEDR
    <c69>   DW_AT_decl_file   : 2
    <c6a>   DW_AT_decl_line   : 269
    <c6c>   DW_AT_decl_column : 17
    <c6d>   DW_AT_type        : <0xa9e>
    <c71>   DW_AT_data_member_location: 8
 <2><c72>: Abbrev Number: 15 (DW_TAG_member)
    <c73>   DW_AT_name        : (indirect string, offset: 0x9ecae): PUPDR
    <c77>   DW_AT_decl_file   : 2
    <c78>   DW_AT_decl_line   : 270
    <c7a>   DW_AT_decl_column : 17
    <c7b>   DW_AT_type        : <0xa9e>
    <c7f>   DW_AT_data_member_location: 12
 <2><c80>: Abbrev Number: 16 (DW_TAG_member)
    <c81>   DW_AT_name        : IDR
    <c85>   DW_AT_decl_file   : 2
    <c86>   DW_AT_decl_line   : 271
    <c88>   DW_AT_decl_column : 17
    <c89>   DW_AT_type        : <0xa9e>
    <c8d>   DW_AT_data_member_location: 16
 <2><c8e>: Abbrev Number: 16 (DW_TAG_member)
    <c8f>   DW_AT_name        : ODR
    <c93>   DW_AT_decl_file   : 2
    <c94>   DW_AT_decl_line   : 272
    <c96>   DW_AT_decl_column : 17
    <c97>   DW_AT_type        : <0xa9e>
    <c9b>   DW_AT_data_member_location: 20
 <2><c9c>: Abbrev Number: 15 (DW_TAG_member)
    <c9d>   DW_AT_name        : (indirect string, offset: 0x9ecf6): BSRR
    <ca1>   DW_AT_decl_file   : 2
    <ca2>   DW_AT_decl_line   : 273
    <ca4>   DW_AT_decl_column : 17
    <ca5>   DW_AT_type        : <0xa9e>
    <ca9>   DW_AT_data_member_location: 24
 <2><caa>: Abbrev Number: 15 (DW_TAG_member)
    <cab>   DW_AT_name        : (indirect string, offset: 0x9f14e): LCKR
    <caf>   DW_AT_decl_file   : 2
    <cb0>   DW_AT_decl_line   : 274
    <cb2>   DW_AT_decl_column : 17
    <cb3>   DW_AT_type        : <0xa9e>
    <cb7>   DW_AT_data_member_location: 28
 <2><cb8>: Abbrev Number: 16 (DW_TAG_member)
    <cb9>   DW_AT_name        : AFR
    <cbd>   DW_AT_decl_file   : 2
    <cbe>   DW_AT_decl_line   : 275
    <cc0>   DW_AT_decl_column : 17
    <cc1>   DW_AT_type        : <0xcd7>
    <cc5>   DW_AT_data_member_location: 32
 <2><cc6>: Abbrev Number: 0
 <1><cc7>: Abbrev Number: 9 (DW_TAG_array_type)
    <cc8>   DW_AT_type        : <0xa9e>
    <ccc>   DW_AT_sibling     : <0xcd7>
 <2><cd0>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <cd1>   DW_AT_type        : <0xa7f>
    <cd5>   DW_AT_upper_bound : 1
 <2><cd6>: Abbrev Number: 0
 <1><cd7>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <cd8>   DW_AT_type        : <0xcc7>
 <1><cdc>: Abbrev Number: 17 (DW_TAG_typedef)
    <cdd>   DW_AT_name        : (indirect string, offset: 0x9f249): GPIO_TypeDef
    <ce1>   DW_AT_decl_file   : 2
    <ce2>   DW_AT_decl_line   : 276
    <ce4>   DW_AT_decl_column : 3
    <ce5>   DW_AT_type        : <0xc3e>
 <1><ce9>: Abbrev Number: 14 (DW_TAG_structure_type)
    <cea>   DW_AT_byte_size   : 144
    <ceb>   DW_AT_decl_file   : 2
    <cec>   DW_AT_decl_line   : 336
    <cee>   DW_AT_decl_column : 9
    <cef>   DW_AT_sibling     : <0xeb3>
 <2><cf3>: Abbrev Number: 16 (DW_TAG_member)
    <cf4>   DW_AT_name        : CR
    <cf7>   DW_AT_decl_file   : 2
    <cf8>   DW_AT_decl_line   : 338
    <cfa>   DW_AT_decl_column : 17
    <cfb>   DW_AT_type        : <0xa9e>
    <cff>   DW_AT_data_member_location: 0
 <2><d00>: Abbrev Number: 15 (DW_TAG_member)
    <d01>   DW_AT_name        : (indirect string, offset: 0x9f04a): PLLCFGR
    <d05>   DW_AT_decl_file   : 2
    <d06>   DW_AT_decl_line   : 339
    <d08>   DW_AT_decl_column : 17
    <d09>   DW_AT_type        : <0xa9e>
    <d0d>   DW_AT_data_member_location: 4
 <2><d0e>: Abbrev Number: 15 (DW_TAG_member)
    <d0f>   DW_AT_name        : (indirect string, offset: 0x9ee9e): CFGR
    <d13>   DW_AT_decl_file   : 2
    <d14>   DW_AT_decl_line   : 340
    <d16>   DW_AT_decl_column : 17
    <d17>   DW_AT_type        : <0xa9e>
    <d1b>   DW_AT_data_member_location: 8
 <2><d1c>: Abbrev Number: 16 (DW_TAG_member)
    <d1d>   DW_AT_name        : CIR
    <d21>   DW_AT_decl_file   : 2
    <d22>   DW_AT_decl_line   : 341
    <d24>   DW_AT_decl_column : 17
    <d25>   DW_AT_type        : <0xa9e>
    <d29>   DW_AT_data_member_location: 12
 <2><d2a>: Abbrev Number: 15 (DW_TAG_member)
    <d2b>   DW_AT_name        : (indirect string, offset: 0x9f0e8): AHB1RSTR
    <d2f>   DW_AT_decl_file   : 2
    <d30>   DW_AT_decl_line   : 342
    <d32>   DW_AT_decl_column : 17
    <d33>   DW_AT_type        : <0xa9e>
    <d37>   DW_AT_data_member_location: 16
 <2><d38>: Abbrev Number: 15 (DW_TAG_member)
    <d39>   DW_AT_name        : (indirect string, offset: 0x9ec2a): AHB2RSTR
    <d3d>   DW_AT_decl_file   : 2
    <d3e>   DW_AT_decl_line   : 343
    <d40>   DW_AT_decl_column : 17
    <d41>   DW_AT_type        : <0xa9e>
    <d45>   DW_AT_data_member_location: 20
 <2><d46>: Abbrev Number: 15 (DW_TAG_member)
    <d47>   DW_AT_name        : (indirect string, offset: 0x9ee92): AHB3RSTR
    <d4b>   DW_AT_decl_file   : 2
    <d4c>   DW_AT_decl_line   : 344
    <d4e>   DW_AT_decl_column : 17
    <d4f>   DW_AT_type        : <0xa9e>
    <d53>   DW_AT_data_member_location: 24
 <2><d54>: Abbrev Number: 15 (DW_TAG_member)
    <d55>   DW_AT_name        : (indirect string, offset: 0x9f1d6): RESERVED0
    <d59>   DW_AT_decl_file   : 2
    <d5a>   DW_AT_decl_line   : 345
    <d5c>   DW_AT_decl_column : 17
    <d5d>   DW_AT_type        : <0xa92>
    <d61>   DW_AT_data_member_location: 28
 <2><d62>: Abbrev Number: 15 (DW_TAG_member)
    <d63>   DW_AT_name        : (indirect string, offset: 0x9ec17): APB1RSTR
    <d67>   DW_AT_decl_file   : 2
    <d68>   DW_AT_decl_line   : 346
    <d6a>   DW_AT_decl_column : 17
    <d6b>   DW_AT_type        : <0xa9e>
    <d6f>   DW_AT_data_member_location: 32
 <2><d70>: Abbrev Number: 15 (DW_TAG_member)
    <d71>   DW_AT_name        : (indirect string, offset: 0x9ee89): APB2RSTR
    <d75>   DW_AT_decl_file   : 2
    <d76>   DW_AT_decl_line   : 347
    <d78>   DW_AT_decl_column : 17
    <d79>   DW_AT_type        : <0xa9e>
    <d7d>   DW_AT_data_member_location: 36
 <2><d7e>: Abbrev Number: 15 (DW_TAG_member)
    <d7f>   DW_AT_name        : (indirect string, offset: 0x9f1e0): RESERVED1
    <d83>   DW_AT_decl_file   : 2
    <d84>   DW_AT_decl_line   : 348
    <d86>   DW_AT_decl_column : 17
    <d87>   DW_AT_type        : <0xab3>
    <d8b>   DW_AT_data_member_location: 40
 <2><d8c>: Abbrev Number: 15 (DW_TAG_member)
    <d8d>   DW_AT_name        : (indirect string, offset: 0x9ebdb): AHB1ENR
    <d91>   DW_AT_decl_file   : 2
    <d92>   DW_AT_decl_line   : 349
    <d94>   DW_AT_decl_column : 17
    <d95>   DW_AT_type        : <0xa9e>
    <d99>   DW_AT_data_member_location: 48
 <2><d9a>: Abbrev Number: 15 (DW_TAG_member)
    <d9b>   DW_AT_name        : (indirect string, offset: 0x9ed3d): AHB2ENR
    <d9f>   DW_AT_decl_file   : 2
    <da0>   DW_AT_decl_line   : 350
    <da2>   DW_AT_decl_column : 17
    <da3>   DW_AT_type        : <0xa9e>
    <da7>   DW_AT_data_member_location: 52
 <2><da8>: Abbrev Number: 15 (DW_TAG_member)
    <da9>   DW_AT_name        : (indirect string, offset: 0x9eebc): AHB3ENR
    <dad>   DW_AT_decl_file   : 2
    <dae>   DW_AT_decl_line   : 351
    <db0>   DW_AT_decl_column : 17
    <db1>   DW_AT_type        : <0xa9e>
    <db5>   DW_AT_data_member_location: 56
 <2><db6>: Abbrev Number: 15 (DW_TAG_member)
    <db7>   DW_AT_name        : (indirect string, offset: 0x9f1ea): RESERVED2
    <dbb>   DW_AT_decl_file   : 2
    <dbc>   DW_AT_decl_line   : 352
    <dbe>   DW_AT_decl_column : 17
    <dbf>   DW_AT_type        : <0xa92>
    <dc3>   DW_AT_data_member_location: 60
 <2><dc4>: Abbrev Number: 15 (DW_TAG_member)
    <dc5>   DW_AT_name        : (indirect string, offset: 0x9f099): APB1ENR
    <dc9>   DW_AT_decl_file   : 2
    <dca>   DW_AT_decl_line   : 353
    <dcc>   DW_AT_decl_column : 17
    <dcd>   DW_AT_type        : <0xa9e>
    <dd1>   DW_AT_data_member_location: 64
 <2><dd2>: Abbrev Number: 15 (DW_TAG_member)
    <dd3>   DW_AT_name        : (indirect string, offset: 0x9ec45): APB2ENR
    <dd7>   DW_AT_decl_file   : 2
    <dd8>   DW_AT_decl_line   : 354
    <dda>   DW_AT_decl_column : 17
    <ddb>   DW_AT_type        : <0xa9e>
    <ddf>   DW_AT_data_member_location: 68
 <2><de0>: Abbrev Number: 15 (DW_TAG_member)
    <de1>   DW_AT_name        : (indirect string, offset: 0x9f1f4): RESERVED3
    <de5>   DW_AT_decl_file   : 2
    <de6>   DW_AT_decl_line   : 355
    <de8>   DW_AT_decl_column : 17
    <de9>   DW_AT_type        : <0xab3>
    <ded>   DW_AT_data_member_location: 72
 <2><dee>: Abbrev Number: 15 (DW_TAG_member)
    <def>   DW_AT_name        : (indirect string, offset: 0x9eef7): AHB1LPENR
    <df3>   DW_AT_decl_file   : 2
    <df4>   DW_AT_decl_line   : 356
    <df6>   DW_AT_decl_column : 17
    <df7>   DW_AT_type        : <0xa9e>
    <dfb>   DW_AT_data_member_location: 80
 <2><dfc>: Abbrev Number: 15 (DW_TAG_member)
    <dfd>   DW_AT_name        : (indirect string, offset: 0x9ecec): AHB2LPENR
    <e01>   DW_AT_decl_file   : 2
    <e02>   DW_AT_decl_line   : 357
    <e04>   DW_AT_decl_column : 17
    <e05>   DW_AT_type        : <0xa9e>
    <e09>   DW_AT_data_member_location: 84
 <2><e0a>: Abbrev Number: 15 (DW_TAG_member)
    <e0b>   DW_AT_name        : (indirect string, offset: 0x9f00c): AHB3LPENR
    <e0f>   DW_AT_decl_file   : 2
    <e10>   DW_AT_decl_line   : 358
    <e12>   DW_AT_decl_column : 17
    <e13>   DW_AT_type        : <0xa9e>
    <e17>   DW_AT_data_member_location: 88
 <2><e18>: Abbrev Number: 15 (DW_TAG_member)
    <e19>   DW_AT_name        : (indirect string, offset: 0x9f1fe): RESERVED4
    <e1d>   DW_AT_decl_file   : 2
    <e1e>   DW_AT_decl_line   : 359
    <e20>   DW_AT_decl_column : 17
    <e21>   DW_AT_type        : <0xa92>
    <e25>   DW_AT_data_member_location: 92
 <2><e26>: Abbrev Number: 15 (DW_TAG_member)
    <e27>   DW_AT_name        : (indirect string, offset: 0x9eff8): APB1LPENR
    <e2b>   DW_AT_decl_file   : 2
    <e2c>   DW_AT_decl_line   : 360
    <e2e>   DW_AT_decl_column : 17
    <e2f>   DW_AT_type        : <0xa9e>
    <e33>   DW_AT_data_member_location: 96
 <2><e34>: Abbrev Number: 15 (DW_TAG_member)
    <e35>   DW_AT_name        : (indirect string, offset: 0x9ebbc): APB2LPENR
    <e39>   DW_AT_decl_file   : 2
    <e3a>   DW_AT_decl_line   : 361
    <e3c>   DW_AT_decl_column : 17
    <e3d>   DW_AT_type        : <0xa9e>
    <e41>   DW_AT_data_member_location: 100
 <2><e42>: Abbrev Number: 15 (DW_TAG_member)
    <e43>   DW_AT_name        : (indirect string, offset: 0x9f208): RESERVED5
    <e47>   DW_AT_decl_file   : 2
    <e48>   DW_AT_decl_line   : 362
    <e4a>   DW_AT_decl_column : 17
    <e4b>   DW_AT_type        : <0xab3>
    <e4f>   DW_AT_data_member_location: 104
 <2><e50>: Abbrev Number: 15 (DW_TAG_member)
    <e51>   DW_AT_name        : (indirect string, offset: 0x9ec70): BDCR
    <e55>   DW_AT_decl_file   : 2
    <e56>   DW_AT_decl_line   : 363
    <e58>   DW_AT_decl_column : 17
    <e59>   DW_AT_type        : <0xa9e>
    <e5d>   DW_AT_data_member_location: 112
 <2><e5e>: Abbrev Number: 16 (DW_TAG_member)
    <e5f>   DW_AT_name        : CSR
    <e63>   DW_AT_decl_file   : 2
    <e64>   DW_AT_decl_line   : 364
    <e66>   DW_AT_decl_column : 17
    <e67>   DW_AT_type        : <0xa9e>
    <e6b>   DW_AT_data_member_location: 116
 <2><e6c>: Abbrev Number: 15 (DW_TAG_member)
    <e6d>   DW_AT_name        : (indirect string, offset: 0x9f212): RESERVED6
    <e71>   DW_AT_decl_file   : 2
    <e72>   DW_AT_decl_line   : 365
    <e74>   DW_AT_decl_column : 17
    <e75>   DW_AT_type        : <0xab3>
    <e79>   DW_AT_data_member_location: 120
 <2><e7a>: Abbrev Number: 15 (DW_TAG_member)
    <e7b>   DW_AT_name        : (indirect string, offset: 0x9ef26): SSCGR
    <e7f>   DW_AT_decl_file   : 2
    <e80>   DW_AT_decl_line   : 366
    <e82>   DW_AT_decl_column : 17
    <e83>   DW_AT_type        : <0xa9e>
    <e87>   DW_AT_data_member_location: 128
 <2><e88>: Abbrev Number: 15 (DW_TAG_member)
    <e89>   DW_AT_name        : (indirect string, offset: 0x9edc6): PLLI2SCFGR
    <e8d>   DW_AT_decl_file   : 2
    <e8e>   DW_AT_decl_line   : 367
    <e90>   DW_AT_decl_column : 17
    <e91>   DW_AT_type        : <0xa9e>
    <e95>   DW_AT_data_member_location: 132
 <2><e96>: Abbrev Number: 15 (DW_TAG_member)
    <e97>   DW_AT_name        : (indirect string, offset: 0x9f21c): RESERVED7
    <e9b>   DW_AT_decl_file   : 2
    <e9c>   DW_AT_decl_line   : 368
    <e9e>   DW_AT_decl_column : 17
    <e9f>   DW_AT_type        : <0xaa3>
    <ea3>   DW_AT_data_member_location: 136
 <2><ea4>: Abbrev Number: 15 (DW_TAG_member)
    <ea5>   DW_AT_name        : (indirect string, offset: 0x9ee9b): DCKCFGR
    <ea9>   DW_AT_decl_file   : 2
    <eaa>   DW_AT_decl_line   : 369
    <eac>   DW_AT_decl_column : 17
    <ead>   DW_AT_type        : <0xa9e>
    <eb1>   DW_AT_data_member_location: 140
 <2><eb2>: Abbrev Number: 0
 <1><eb3>: Abbrev Number: 17 (DW_TAG_typedef)
    <eb4>   DW_AT_name        : (indirect string, offset: 0x9eece): RCC_TypeDef
    <eb8>   DW_AT_decl_file   : 2
    <eb9>   DW_AT_decl_line   : 370
    <ebb>   DW_AT_decl_column : 3
    <ebc>   DW_AT_type        : <0xce9>
 <1><ec0>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <ec1>   DW_AT_encoding    : 7	(unsigned)
    <ec2>   DW_AT_byte_size   : 1
    <ec3>   DW_AT_type        : <0xa2f>
    <ec7>   DW_AT_decl_file   : 5
    <ec8>   DW_AT_decl_line   : 191
    <ec9>   DW_AT_decl_column : 1
    <eca>   DW_AT_sibling     : <0xedb>
 <2><ece>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ecf>   DW_AT_name        : (indirect string, offset: 0x4b22e): DISABLE
    <ed3>   DW_AT_const_value : 0
 <2><ed4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ed5>   DW_AT_name        : (indirect string, offset: 0x8fbc2): ENABLE
    <ed9>   DW_AT_const_value : 1
 <2><eda>: Abbrev Number: 0
 <1><edb>: Abbrev Number: 6 (DW_TAG_typedef)
    <edc>   DW_AT_name        : (indirect string, offset: 0x9f2ac): FunctionalState
    <ee0>   DW_AT_decl_file   : 5
    <ee1>   DW_AT_decl_line   : 194
    <ee2>   DW_AT_decl_column : 3
    <ee3>   DW_AT_type        : <0xec0>
 <1><ee7>: Abbrev Number: 5 (DW_TAG_base_type)
    <ee8>   DW_AT_byte_size   : 8
    <ee9>   DW_AT_encoding    : 4	(float)
    <eea>   DW_AT_name        : (indirect string, offset: 0x81aec): long double
 <1><eee>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <eef>   DW_AT_encoding    : 7	(unsigned)
    <ef0>   DW_AT_byte_size   : 1
    <ef1>   DW_AT_type        : <0xa2f>
    <ef5>   DW_AT_decl_file   : 6
    <ef6>   DW_AT_decl_line   : 39
    <ef7>   DW_AT_decl_column : 1
    <ef8>   DW_AT_sibling     : <0xf15>
 <2><efc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <efd>   DW_AT_name        : (indirect string, offset: 0x3551a): HAL_OK
    <f01>   DW_AT_const_value : 0
 <2><f02>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f03>   DW_AT_name        : (indirect string, offset: 0x62995): HAL_ERROR
    <f07>   DW_AT_const_value : 1
 <2><f08>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f09>   DW_AT_name        : (indirect string, offset: 0x840a7): HAL_BUSY
    <f0d>   DW_AT_const_value : 2
 <2><f0e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f0f>   DW_AT_name        : (indirect string, offset: 0x2e53e): HAL_TIMEOUT
    <f13>   DW_AT_const_value : 3
 <2><f14>: Abbrev Number: 0
 <1><f15>: Abbrev Number: 6 (DW_TAG_typedef)
    <f16>   DW_AT_name        : (indirect string, offset: 0x8d977): HAL_StatusTypeDef
    <f1a>   DW_AT_decl_file   : 6
    <f1b>   DW_AT_decl_line   : 44
    <f1c>   DW_AT_decl_column : 3
    <f1d>   DW_AT_type        : <0xeee>
 <1><f21>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <f22>   DW_AT_encoding    : 7	(unsigned)
    <f23>   DW_AT_byte_size   : 1
    <f24>   DW_AT_type        : <0xa2f>
    <f28>   DW_AT_decl_file   : 6
    <f29>   DW_AT_decl_line   : 50
    <f2a>   DW_AT_decl_column : 1
    <f2b>   DW_AT_sibling     : <0xf3c>
 <2><f2f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f30>   DW_AT_name        : (indirect string, offset: 0x75181): HAL_UNLOCKED
    <f34>   DW_AT_const_value : 0
 <2><f35>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f36>   DW_AT_name        : (indirect string, offset: 0x9dcf4): HAL_LOCKED
    <f3a>   DW_AT_const_value : 1
 <2><f3b>: Abbrev Number: 0
 <1><f3c>: Abbrev Number: 6 (DW_TAG_typedef)
    <f3d>   DW_AT_name        : (indirect string, offset: 0x602b8): HAL_LockTypeDef
    <f41>   DW_AT_decl_file   : 6
    <f42>   DW_AT_decl_line   : 53
    <f43>   DW_AT_decl_column : 3
    <f44>   DW_AT_type        : <0xf21>
 <1><f48>: Abbrev Number: 11 (DW_TAG_structure_type)
    <f49>   DW_AT_byte_size   : 20
    <f4a>   DW_AT_decl_file   : 7
    <f4b>   DW_AT_decl_line   : 46
    <f4c>   DW_AT_decl_column : 9
    <f4d>   DW_AT_sibling     : <0xf93>
 <2><f51>: Abbrev Number: 12 (DW_TAG_member)
    <f52>   DW_AT_name        : Pin
    <f56>   DW_AT_decl_file   : 7
    <f57>   DW_AT_decl_line   : 48
    <f58>   DW_AT_decl_column : 12
    <f59>   DW_AT_type        : <0xa92>
    <f5d>   DW_AT_data_member_location: 0
 <2><f5e>: Abbrev Number: 13 (DW_TAG_member)
    <f5f>   DW_AT_name        : (indirect string, offset: 0xa51c5): Mode
    <f63>   DW_AT_decl_file   : 7
    <f64>   DW_AT_decl_line   : 51
    <f65>   DW_AT_decl_column : 12
    <f66>   DW_AT_type        : <0xa92>
    <f6a>   DW_AT_data_member_location: 4
 <2><f6b>: Abbrev Number: 13 (DW_TAG_member)
    <f6c>   DW_AT_name        : (indirect string, offset: 0x9ef0a): Pull
    <f70>   DW_AT_decl_file   : 7
    <f71>   DW_AT_decl_line   : 54
    <f72>   DW_AT_decl_column : 12
    <f73>   DW_AT_type        : <0xa92>
    <f77>   DW_AT_data_member_location: 8
 <2><f78>: Abbrev Number: 13 (DW_TAG_member)
    <f79>   DW_AT_name        : (indirect string, offset: 0x9f6f6): Speed
    <f7d>   DW_AT_decl_file   : 7
    <f7e>   DW_AT_decl_line   : 57
    <f7f>   DW_AT_decl_column : 12
    <f80>   DW_AT_type        : <0xa92>
    <f84>   DW_AT_data_member_location: 12
 <2><f85>: Abbrev Number: 13 (DW_TAG_member)
    <f86>   DW_AT_name        : (indirect string, offset: 0x9eec4): Alternate
    <f8a>   DW_AT_decl_file   : 7
    <f8b>   DW_AT_decl_line   : 60
    <f8c>   DW_AT_decl_column : 12
    <f8d>   DW_AT_type        : <0xa92>
    <f91>   DW_AT_data_member_location: 16
 <2><f92>: Abbrev Number: 0
 <1><f93>: Abbrev Number: 6 (DW_TAG_typedef)
    <f94>   DW_AT_name        : (indirect string, offset: 0x9f0d7): GPIO_InitTypeDef
    <f98>   DW_AT_decl_file   : 7
    <f99>   DW_AT_decl_line   : 62
    <f9a>   DW_AT_decl_column : 2
    <f9b>   DW_AT_type        : <0xf48>
 <1><f9f>: Abbrev Number: 11 (DW_TAG_structure_type)
    <fa0>   DW_AT_byte_size   : 48
    <fa1>   DW_AT_decl_file   : 8
    <fa2>   DW_AT_decl_line   : 48
    <fa3>   DW_AT_decl_column : 9
    <fa4>   DW_AT_sibling     : <0x1045>
 <2><fa8>: Abbrev Number: 13 (DW_TAG_member)
    <fa9>   DW_AT_name        : (indirect string, offset: 0xa1635): Channel
    <fad>   DW_AT_decl_file   : 8
    <fae>   DW_AT_decl_line   : 50
    <faf>   DW_AT_decl_column : 12
    <fb0>   DW_AT_type        : <0xa92>
    <fb4>   DW_AT_data_member_location: 0
 <2><fb5>: Abbrev Number: 13 (DW_TAG_member)
    <fb6>   DW_AT_name        : (indirect string, offset: 0xa2fee): Direction
    <fba>   DW_AT_decl_file   : 8
    <fbb>   DW_AT_decl_line   : 53
    <fbc>   DW_AT_decl_column : 12
    <fbd>   DW_AT_type        : <0xa92>
    <fc1>   DW_AT_data_member_location: 4
 <2><fc2>: Abbrev Number: 13 (DW_TAG_member)
    <fc3>   DW_AT_name        : (indirect string, offset: 0xa55d): PeriphInc
    <fc7>   DW_AT_decl_file   : 8
    <fc8>   DW_AT_decl_line   : 57
    <fc9>   DW_AT_decl_column : 12
    <fca>   DW_AT_type        : <0xa92>
    <fce>   DW_AT_data_member_location: 8
 <2><fcf>: Abbrev Number: 13 (DW_TAG_member)
    <fd0>   DW_AT_name        : (indirect string, offset: 0x19868): MemInc
    <fd4>   DW_AT_decl_file   : 8
    <fd5>   DW_AT_decl_line   : 60
    <fd6>   DW_AT_decl_column : 12
    <fd7>   DW_AT_type        : <0xa92>
    <fdb>   DW_AT_data_member_location: 12
 <2><fdc>: Abbrev Number: 13 (DW_TAG_member)
    <fdd>   DW_AT_name        : (indirect string, offset: 0x4ebb8): PeriphDataAlignment
    <fe1>   DW_AT_decl_file   : 8
    <fe2>   DW_AT_decl_line   : 63
    <fe3>   DW_AT_decl_column : 12
    <fe4>   DW_AT_type        : <0xa92>
    <fe8>   DW_AT_data_member_location: 16
 <2><fe9>: Abbrev Number: 13 (DW_TAG_member)
    <fea>   DW_AT_name        : (indirect string, offset: 0x8e9e5): MemDataAlignment
    <fee>   DW_AT_decl_file   : 8
    <fef>   DW_AT_decl_line   : 66
    <ff0>   DW_AT_decl_column : 12
    <ff1>   DW_AT_type        : <0xa92>
    <ff5>   DW_AT_data_member_location: 20
 <2><ff6>: Abbrev Number: 13 (DW_TAG_member)
    <ff7>   DW_AT_name        : (indirect string, offset: 0xa51c5): Mode
    <ffb>   DW_AT_decl_file   : 8
    <ffc>   DW_AT_decl_line   : 69
    <ffd>   DW_AT_decl_column : 12
    <ffe>   DW_AT_type        : <0xa92>
    <1002>   DW_AT_data_member_location: 24
 <2><1003>: Abbrev Number: 13 (DW_TAG_member)
    <1004>   DW_AT_name        : (indirect string, offset: 0xa1ab3): Priority
    <1008>   DW_AT_decl_file   : 8
    <1009>   DW_AT_decl_line   : 74
    <100a>   DW_AT_decl_column : 12
    <100b>   DW_AT_type        : <0xa92>
    <100f>   DW_AT_data_member_location: 28
 <2><1010>: Abbrev Number: 13 (DW_TAG_member)
    <1011>   DW_AT_name        : (indirect string, offset: 0x4400f): FIFOMode
    <1015>   DW_AT_decl_file   : 8
    <1016>   DW_AT_decl_line   : 77
    <1017>   DW_AT_decl_column : 12
    <1018>   DW_AT_type        : <0xa92>
    <101c>   DW_AT_data_member_location: 32
 <2><101d>: Abbrev Number: 13 (DW_TAG_member)
    <101e>   DW_AT_name        : (indirect string, offset: 0x78603): FIFOThreshold
    <1022>   DW_AT_decl_file   : 8
    <1023>   DW_AT_decl_line   : 82
    <1024>   DW_AT_decl_column : 12
    <1025>   DW_AT_type        : <0xa92>
    <1029>   DW_AT_data_member_location: 36
 <2><102a>: Abbrev Number: 13 (DW_TAG_member)
    <102b>   DW_AT_name        : (indirect string, offset: 0x76c2d): MemBurst
    <102f>   DW_AT_decl_file   : 8
    <1030>   DW_AT_decl_line   : 85
    <1031>   DW_AT_decl_column : 12
    <1032>   DW_AT_type        : <0xa92>
    <1036>   DW_AT_data_member_location: 40
 <2><1037>: Abbrev Number: 13 (DW_TAG_member)
    <1038>   DW_AT_name        : (indirect string, offset: 0x36287): PeriphBurst
    <103c>   DW_AT_decl_file   : 8
    <103d>   DW_AT_decl_line   : 91
    <103e>   DW_AT_decl_column : 12
    <103f>   DW_AT_type        : <0xa92>
    <1043>   DW_AT_data_member_location: 44
 <2><1044>: Abbrev Number: 0
 <1><1045>: Abbrev Number: 6 (DW_TAG_typedef)
    <1046>   DW_AT_name        : (indirect string, offset: 0x2aaa1): DMA_InitTypeDef
    <104a>   DW_AT_decl_file   : 8
    <104b>   DW_AT_decl_line   : 96
    <104c>   DW_AT_decl_column : 2
    <104d>   DW_AT_type        : <0xf9f>
 <1><1051>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <1052>   DW_AT_encoding    : 7	(unsigned)
    <1053>   DW_AT_byte_size   : 1
    <1054>   DW_AT_type        : <0xa2f>
    <1058>   DW_AT_decl_file   : 8
    <1059>   DW_AT_decl_line   : 103
    <105a>   DW_AT_decl_column : 1
    <105b>   DW_AT_sibling     : <0x1084>
 <2><105f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1060>   DW_AT_name        : (indirect string, offset: 0x76113): HAL_DMA_STATE_RESET
    <1064>   DW_AT_const_value : 0
 <2><1065>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1066>   DW_AT_name        : (indirect string, offset: 0x2b953): HAL_DMA_STATE_READY
    <106a>   DW_AT_const_value : 1
 <2><106b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <106c>   DW_AT_name        : (indirect string, offset: 0x6d27b): HAL_DMA_STATE_BUSY
    <1070>   DW_AT_const_value : 2
 <2><1071>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1072>   DW_AT_name        : (indirect string, offset: 0x9b66a): HAL_DMA_STATE_TIMEOUT
    <1076>   DW_AT_const_value : 3
 <2><1077>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1078>   DW_AT_name        : (indirect string, offset: 0x87271): HAL_DMA_STATE_ERROR
    <107c>   DW_AT_const_value : 4
 <2><107d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <107e>   DW_AT_name        : (indirect string, offset: 0x245af): HAL_DMA_STATE_ABORT
    <1082>   DW_AT_const_value : 5
 <2><1083>: Abbrev Number: 0
 <1><1084>: Abbrev Number: 6 (DW_TAG_typedef)
    <1085>   DW_AT_name        : (indirect string, offset: 0x577a4): HAL_DMA_StateTypeDef
    <1089>   DW_AT_decl_file   : 8
    <108a>   DW_AT_decl_line   : 110
    <108b>   DW_AT_decl_column : 2
    <108c>   DW_AT_type        : <0x1051>
 <1><1090>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <1091>   DW_AT_type        : <0x1084>
 <1><1095>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1096>   DW_AT_name        : (indirect string, offset: 0x866c6): __DMA_HandleTypeDef
    <109a>   DW_AT_byte_size   : 96
    <109b>   DW_AT_decl_file   : 8
    <109c>   DW_AT_decl_line   : 138
    <109d>   DW_AT_decl_column : 16
    <109e>   DW_AT_sibling     : <0x1159>
 <2><10a2>: Abbrev Number: 13 (DW_TAG_member)
    <10a3>   DW_AT_name        : (indirect string, offset: 0x3d5c2): Instance
    <10a7>   DW_AT_decl_file   : 8
    <10a8>   DW_AT_decl_line   : 140
    <10a9>   DW_AT_decl_column : 31
    <10aa>   DW_AT_type        : <0x1159>
    <10ae>   DW_AT_data_member_location: 0
 <2><10af>: Abbrev Number: 13 (DW_TAG_member)
    <10b0>   DW_AT_name        : (indirect string, offset: 0xa2513): Init
    <10b4>   DW_AT_decl_file   : 8
    <10b5>   DW_AT_decl_line   : 142
    <10b6>   DW_AT_decl_column : 30
    <10b7>   DW_AT_type        : <0x1045>
    <10bb>   DW_AT_data_member_location: 4
 <2><10bc>: Abbrev Number: 13 (DW_TAG_member)
    <10bd>   DW_AT_name        : (indirect string, offset: 0xa21c2): Lock
    <10c1>   DW_AT_decl_file   : 8
    <10c2>   DW_AT_decl_line   : 144
    <10c3>   DW_AT_decl_column : 30
    <10c4>   DW_AT_type        : <0xf3c>
    <10c8>   DW_AT_data_member_location: 52
 <2><10c9>: Abbrev Number: 13 (DW_TAG_member)
    <10ca>   DW_AT_name        : (indirect string, offset: 0x9fcb3): State
    <10ce>   DW_AT_decl_file   : 8
    <10cf>   DW_AT_decl_line   : 146
    <10d0>   DW_AT_decl_column : 30
    <10d1>   DW_AT_type        : <0x1090>
    <10d5>   DW_AT_data_member_location: 53
 <2><10d6>: Abbrev Number: 13 (DW_TAG_member)
    <10d7>   DW_AT_name        : (indirect string, offset: 0x9624c): Parent
    <10db>   DW_AT_decl_file   : 8
    <10dc>   DW_AT_decl_line   : 148
    <10dd>   DW_AT_decl_column : 31
    <10de>   DW_AT_type        : <0x115f>
    <10e2>   DW_AT_data_member_location: 56
 <2><10e3>: Abbrev Number: 13 (DW_TAG_member)
    <10e4>   DW_AT_name        : (indirect string, offset: 0x9d516): XferCpltCallback
    <10e8>   DW_AT_decl_file   : 8
    <10e9>   DW_AT_decl_line   : 150
    <10ea>   DW_AT_decl_column : 33
    <10eb>   DW_AT_type        : <0x1172>
    <10ef>   DW_AT_data_member_location: 60
 <2><10f0>: Abbrev Number: 13 (DW_TAG_member)
    <10f1>   DW_AT_name        : (indirect string, offset: 0x7adbe): XferHalfCpltCallback
    <10f5>   DW_AT_decl_file   : 8
    <10f6>   DW_AT_decl_line   : 152
    <10f7>   DW_AT_decl_column : 33
    <10f8>   DW_AT_type        : <0x1172>
    <10fc>   DW_AT_data_member_location: 64
 <2><10fd>: Abbrev Number: 13 (DW_TAG_member)
    <10fe>   DW_AT_name        : (indirect string, offset: 0x261d8): XferM1CpltCallback
    <1102>   DW_AT_decl_file   : 8
    <1103>   DW_AT_decl_line   : 154
    <1104>   DW_AT_decl_column : 33
    <1105>   DW_AT_type        : <0x1172>
    <1109>   DW_AT_data_member_location: 68
 <2><110a>: Abbrev Number: 13 (DW_TAG_member)
    <110b>   DW_AT_name        : (indirect string, offset: 0x579d8): XferM1HalfCpltCallback
    <110f>   DW_AT_decl_file   : 8
    <1110>   DW_AT_decl_line   : 156
    <1111>   DW_AT_decl_column : 33
    <1112>   DW_AT_type        : <0x1172>
    <1116>   DW_AT_data_member_location: 72
 <2><1117>: Abbrev Number: 13 (DW_TAG_member)
    <1118>   DW_AT_name        : (indirect string, offset: 0x176b7): XferErrorCallback
    <111c>   DW_AT_decl_file   : 8
    <111d>   DW_AT_decl_line   : 158
    <111e>   DW_AT_decl_column : 33
    <111f>   DW_AT_type        : <0x1172>
    <1123>   DW_AT_data_member_location: 76
 <2><1124>: Abbrev Number: 13 (DW_TAG_member)
    <1125>   DW_AT_name        : (indirect string, offset: 0x93740): XferAbortCallback
    <1129>   DW_AT_decl_file   : 8
    <112a>   DW_AT_decl_line   : 160
    <112b>   DW_AT_decl_column : 33
    <112c>   DW_AT_type        : <0x1172>
    <1130>   DW_AT_data_member_location: 80
 <2><1131>: Abbrev Number: 13 (DW_TAG_member)
    <1132>   DW_AT_name        : (indirect string, offset: 0xa2002): ErrorCode
    <1136>   DW_AT_decl_file   : 8
    <1137>   DW_AT_decl_line   : 162
    <1138>   DW_AT_decl_column : 30
    <1139>   DW_AT_type        : <0xa9e>
    <113d>   DW_AT_data_member_location: 84
 <2><113e>: Abbrev Number: 13 (DW_TAG_member)
    <113f>   DW_AT_name        : (indirect string, offset: 0x778a3): StreamBaseAddress
    <1143>   DW_AT_decl_file   : 8
    <1144>   DW_AT_decl_line   : 164
    <1145>   DW_AT_decl_column : 30
    <1146>   DW_AT_type        : <0xa92>
    <114a>   DW_AT_data_member_location: 88
 <2><114b>: Abbrev Number: 13 (DW_TAG_member)
    <114c>   DW_AT_name        : (indirect string, offset: 0x84e42): StreamIndex
    <1150>   DW_AT_decl_file   : 8
    <1151>   DW_AT_decl_line   : 166
    <1152>   DW_AT_decl_column : 30
    <1153>   DW_AT_type        : <0xa92>
    <1157>   DW_AT_data_member_location: 92
 <2><1158>: Abbrev Number: 0
